<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#33363b">
    <meta name="msapplication-TileColor" content="#33363b">
    
    
    <meta name="google-site-verification" content="VmX1m6eF3rZhAf1iR5DhqrbiF_5se-s902W14pPryQk">
    
    
    <meta name="keywords" content="Code, Music, Life, Linux, Arch Linux, Gentoo, JavaScript, ARIA, Hikaru">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#33363b">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="喵's StackHarbor" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/clipboard.min.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      $(".post pre code figure.highlight").each(function (i, e) {
        $(e).before("<button class=\"copy button\">复制</button>");
      });
      var cb = new ClipboardJS("button.copy", {
        "target": function (trigger) {
            // Get target element by DOM API.
            // nextElementSibling is figure,highlight, lastChild is pre.code.
            return trigger.nextElementSibling.lastChild;
        }
      });
      cb.on("success", function (e) {
        e.clearSelection();
        var trigger = e.trigger;
        // Change button text as a user tip.
        trigger.innerHTML = "已复制";
        $(trigger).addClass("copied");
        // Change button text back;
        setTimeout(function () {
          trigger.innerHTML = "复制";
          $(trigger).removeClass("copied");
        }, 1500);
      });
    });
    </script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>Magnolia | 喵's StackHarbor - Whisper to the World</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="zh_CN" data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #33363b;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">喵's StackHarbor</a></h1>
        <h2 class="subtitle">Whisper to the World</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="切换导航栏"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">首页</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">归档</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">分类</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">标签</span></a></li>
        
        <li role="menuitem"><a href="/Undefined-Shell-Works/"><i class="fas fa-terminal"></i><span class="menu-text">Undefined Shell Works!</span></a></li>
        
        <li role="menuitem"><a href="/blogroll/"><i class="fas fa-link"></i><span class="menu-text">友情链接</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">关于</span></a></li>
        
      </ul>
    </nav>
  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card animate" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://sh.alynx.xyz/posts/Magnolia/">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="Alynx Zhou">
        <meta itemprop="description" content="望むものなら残さず<br>輝ける自分らしさで">
        <meta itemprop="image" content="/images/Future_Gazer_small.png">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="喵's StackHarbor">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">Magnolia</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2019-04-01T12:52:00.000Z">2019-04-01 周一 20:52:00 CST</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/" itemprop="url" rel="index"><span itemprop="name">随记</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <p>&#x6211;&#x4E0D;&#x662F;&#x5F88;&#x80FD;&#x6B23;&#x8D4F;&#x82B1;&#x3002;</p>
<p>&#x6211;&#x7684;&#x9F3B;&#x5B50;&#x5E76;&#x4E0D;&#x61C2;&#x5F97;&#x82B1;&#x7684;&#x82AC;&#x82B3;&#xFF0C;&#x6211;&#x7684;&#x773C;&#x775B;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x4E86;&#x89E3;&#x82B1;&#x7684;&#x9C9C;&#x8273;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x8FDE;&#x5206;&#x8FA8;&#x82B1;&#x79CD;&#x7C7B;&#x7684;&#x5174;&#x8DA3;&#x90FD;&#x6CA1;&#x6709;&#x3002;&#x4F46;&#x6211;&#x4ECA;&#x5929;&#x8FD8;&#x662F;&#x8BA4;&#x51FA;&#x4E86;&#x4E00;&#x682A;&#x7389;&#x5170;&#x6811;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x9AD8;&#x4E2D;&#x697C;&#x95E8;&#x53E3;&#x4E24;&#x4FA7;&#x7684;&#x7389;&#x5170;&#x6811;&#x4E00;&#x6837;&#xFF0C;&#x5F00;&#x7740;&#x767D;&#x8272;&#x82B1;&#x74E3;&#x3002;</p>
<a id="more"></a>

<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8BA4;&#x5F97;&#x7389;&#x5170;&#x82B1;&#xFF0C;&#x8BF4;&#x8D77;&#x6765;&#x662F;&#x4E2A;&#x5F88;&#x5947;&#x602A;&#x7684;&#x7406;&#x7531;&#xFF0C;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x6211;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x4E00;&#x6B3E;&#x5305;&#x88C5;&#x4E0A;&#x5370;&#x7740;&#x7389;&#x5170;&#x82B1;&#x7684;&#x7EB8;&#x5DFE;&#xFF0C;&#x6211;&#x5F88;&#x559C;&#x6B22;&#x90A3;&#x6B3E;&#x5305;&#x88C5;&#x7684;&#x7740;&#x8272;&#x6548;&#x679C;&#xFF0C;&#x867D;&#x7136;&#x53EA;&#x662F;&#x5851;&#x6599;&#x5236;&#x54C1;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x7740;&#x72EC;&#x7279;&#x7684;&#x6E29;&#x6DA6;&#x611F;&#x89C9;&#x3002;&#x53E6;&#x5916;&#x5927;&#x6982;&#x4E5F;&#x6709;&#x539F;&#x56E0;&#x662F;&#x5B83;&#x5473;&#x9053;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x6D53;&#xFF0C;&#x592A;&#x6D53;&#x7684;&#x5473;&#x9053;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x4E0D;&#x8212;&#x670D;&#x3002;&#x5982;&#x679C;&#x6211;&#x6CA1;&#x8BB0;&#x9519;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x8FD8;&#x7559;&#x7740;&#x4E00;&#x4EFD;&#x5305;&#x88C5;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x8FD9;&#x4EF6;&#x4E8B;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7ED3;&#x5C3E;&#xFF0C;&#x5C31;&#x50CF;&#x6240;&#x6709;&#x70C2;&#x4FD7;&#x7684;&#x9752;&#x6625;&#x6587;&#x5B66;&#x4E00;&#x6837;&#x3002;&#x540E;&#x6765;&#x90A3;&#x6B3E;&#x7EB8;&#x5DFE;&#x66F4;&#x6362;&#x4E86;&#x65B0;&#x7684;&#x5305;&#x88C5;&#xFF0C;&#x867D;&#x7136;&#x8FD8;&#x662F;&#x7389;&#x5170;&#x4E3A;&#x4E3B;&#x9898;&#xFF0C;&#x4F46;&#x914D;&#x8272;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x4E86;&#x4E4B;&#x524D;&#x7684;&#x7075;&#x6027;&#x3002;&#x6211;&#x4EE5;&#x4E3A;&#x6211;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x5F88;&#x7F3A;&#x4E4F;&#x5BA1;&#x7F8E;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x65B0;&#x5305;&#x88C5;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x4E0D;&#x4F46;&#x7F3A;&#x4E4F;&#x5BA1;&#x7F8E;&#xFF0C;&#x8FD8;&#x80FD;&#x8DD1;&#x51FA;&#x6765;&#x5371;&#x5BB3;&#x5927;&#x5BB6;&#x7684;&#x773C;&#x775B;&#x3002;</p>
<hr>
<p>&#x6211;&#x603B;&#x662F;&#x8BB0;&#x4E0D;&#x4F4F;&#x7389;&#x5170;&#x7684;&#x82F1;&#x6587;&#x8BE5;&#x600E;&#x4E48;&#x62FC;&#xFF0C;&#x8BF4;&#x9519;&#x4E86;&#xFF0C;&#x6211;&#x5927;&#x6982;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x5916;&#x7684;&#x4E00;&#x5207;&#x82F1;&#x6587;&#x540D;&#x8BCD;&#x90FD;&#x4E0D;&#x600E;&#x4E48;&#x654F;&#x611F;&#x3002;&#x591A;&#x534A;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5E76;&#x4E0D;&#x4F1A;&#x8BFB;&#x8FD9;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;Mangolia&#xFF0C;&#x4E0D;&#x5BF9;&#xFF0C;Magnolia&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4F1A;&#x5206;&#x4E0D;&#x6E05;&#x695A;&#x201C;&#x7389;&#x5170;&#x201D;&#x548C;&#x201C;&#x8499;&#x53E4;&#x201D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5148;&#x4E0D;&#x8C08;&#x6709;&#x7740;&#x4F24;&#x611F;&#x7ED3;&#x5C40;&#x7684;&#x7389;&#x5170;&#x7EB8;&#x5DFE;&#xFF0C;&#x5148;&#x8C08;&#x771F;&#x6B63;&#x7684;&#x7389;&#x5170;&#x82B1;&#x3002;&#x5927;&#x6982;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x4EBA;&#x6CE8;&#x610F;&#x9AD8;&#x4E2D;&#x6821;&#x56ED;&#x91CC;&#x7684;&#x4E24;&#x9897;&#x7389;&#x5170;&#x6811;&#xFF0C;&#x6BD5;&#x7ADF;&#x9AD8;&#x4E2D;&#x751F;&#x6BCF;&#x5929;&#x6709;&#x592A;&#x591A;&#x65E0;&#x804A;&#x7684;&#x4E8B;&#x60C5;&#x8981;&#x8003;&#x8651;&#x4E86;&#xFF0C;&#x8C01;&#x4E5F;&#x6CA1;&#x6709;&#x90A3;&#x4E2A;&#x95F2;&#x60C5;&#x9038;&#x81F4;&#xFF0C;&#x51B5;&#x4E14;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E5F;&#x6CA1;&#x5174;&#x8DA3;&#x4E86;&#x89E3;&#x690D;&#x7269;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4E5F;&#x5305;&#x62EC;&#x6211;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6625;&#x5929;&#x522E;&#x98CE;&#x662F;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x4E3B;&#x8981;&#x7684;&#x6C14;&#x5019;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5E76;&#x4E0D;&#x662F;&#x5341;&#x5206;&#x7684;&#x6CA1;&#x6709;&#x4EBA;&#x60C5;&#x5473;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x7389;&#x5170;&#x82B1;&#x5F00;&#x653E;&#x7684;&#x5B63;&#x8282;&#xFF0C;&#x4E5F;&#x662F;&#x4F1A;&#x65E0;&#x7F18;&#x65E0;&#x6545;&#x843D;&#x4E0B;&#x4E00;&#x573A;&#x6625;&#x96E8;&#x7684;&#x65F6;&#x5019;&#x3002;&#x603B;&#x662F;&#x80FD;&#x6709;&#x4E00;&#x4E9B;&#x65E5;&#x5B50;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x64CD;&#x573A;&#x4E0A;&#x7684;&#x6C34;&#x6D3C;&#x91CC;&#x770B;&#x89C1;&#x5915;&#x9633;&#x7684;&#x5012;&#x5F71;&#x3002;&#x4E5F;&#x80FD;&#x5728;&#x6811;&#x4E0B;&#x770B;&#x5230;&#x968F;&#x7740;&#x96E8;&#x70B9;&#x4E00;&#x5E76;&#x843D;&#x4E0B;&#x7684;&#x82B1;&#x74E3;&#x3002;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x6811;&#x4E0A;&#x7684;&#x82B1;&#x74E3;&#x90FD;&#x843D;&#x5149;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x6709;&#x4EBA;&#x60C5;&#x5473;&#x7684;&#x6625;&#x5929;&#x4E5F;&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#x3002;</p>
<hr>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x7389;&#x5170;&#x7684;&#x82B1;&#x8BED;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x9057;&#x61BE;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x56F4;&#x7ED5;&#x7389;&#x5170;&#x82B1;&#x7684;&#x82B1;&#x8BED;&#x5199;&#x51FA;&#x4E00;&#x7BC7;&#x5C0F;&#x8BF4;&#x3002;&#x4E0D;&#x8FC7;&#x53CD;&#x6B63;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x4EBA;&#x9644;&#x52A0;&#x7684;&#x542B;&#x4E49;&#x800C;&#x5DF2;&#xFF0C;&#x5C31;&#x7B97;&#x67D0;&#x79CD;&#x82B1;&#x7684;&#x82B1;&#x8BED;&#x662F;&#x9047;&#x89C1;&#x5E78;&#x798F;&#xFF0C;&#x90A3;&#x5C31;&#x771F;&#x7684;&#x80FD;&#x8BA9;&#x4EBA;&#x9047;&#x89C1;&#x5E78;&#x798F;&#x4E86;&#x5417;&#xFF1F;</p>
<p>&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x4E0D;&#x8981;&#x592A;&#x76F8;&#x4FE1;&#x90A3;&#x4E9B;&#x672C;&#x6765;&#x662F;&#x8BB2;&#x7ED9;&#x5C0F;&#x5B69;&#x5B50;&#x542C;&#x7684;&#x8BDD;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x6BD5;&#x7ADF;&#x7AE5;&#x8BDD;&#x5176;&#x5B9E;&#x662F;&#x5927;&#x4EBA;&#x5199;&#x7ED9;&#x5927;&#x4EBA;&#x770B;&#x7684;&#x3002;</p>
<p>&#x66FE;&#x7ECF;&#x6211;&#x4EE5;&#x4E3A;&#x597D;&#x642D;&#x6863;&#x5C31;&#x5E94;&#x8BE5;&#x6C38;&#x4E0D;&#x5206;&#x79BB;&#xFF0C;&#x66FE;&#x7ECF;&#x6211;&#x4EE5;&#x4E3A;&#x6545;&#x4E8B;&#x5C31;&#x5E94;&#x8BE5;&#x5341;&#x5168;&#x5341;&#x7F8E;&#xFF0C;&#x4F46;&#x540E;&#x6765;&#x6211;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x624D;&#x66F4;&#x771F;&#x5B9E;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x6210;&#x5E74;&#x4EBA;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x5C0A;&#x91CD;&#x6BCF;&#x4E2A;&#x4EBA;&#x4E0D;&#x540C;&#x7684;&#x51B3;&#x5B9A;&#xFF0C;&#x54EA;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5730;&#x65B9;&#x53EF;&#x4EE5;&#x800D;&#x5C0F;&#x5B69;&#x5B50;&#x6C14;&#x3002;</p>
<hr>
<p>&#x6211;&#x6700;&#x8FD1;&#x5728;&#x5B66;&#x65E5;&#x8BED;&#xFF0C;&#x4E5F;&#x7B97;&#x662F;&#x7EC8;&#x4E8E;&#x5F00;&#x59CB;&#x5B9E;&#x73B0;&#x5F88;&#x4E45;&#x4EE5;&#x6765;&#x7684;&#x5FC3;&#x613F;&#x4E86;&#x5427;&#x3002;</p>
<p>&#x8001;&#x5E08;&#x8BF4;&#x65E5;&#x8BED;&#x91CC;&#x9762;&#x5E76;&#x4E0D;&#x4F1A;&#x7ECF;&#x5E38;&#x91CD;&#x590D;&#x4E3B;&#x8BED;&#xFF0C;&#x6BD4;&#x5982;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x91CC;&#x5DF2;&#x7ECF;&#x8BF4;&#x8FC7;&#x4E3B;&#x8BED;&#x662F;&#x201C;&#x6211;&#x201D;&#xFF0C;&#x7B2C;&#x4E8C;&#x53E5;&#x5C31;&#x6CA1;&#x5FC5;&#x8981;&#x518D;&#x91CD;&#x590D;&#x4E86;&#x3002;</p>
<p>&#x6709;&#x65F6;&#x5019;&#x6211;&#x5199;&#x4E1C;&#x897F;&#x4E5F;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4E0D;&#x592A;&#x613F;&#x610F;&#x5728;&#x53E5;&#x5B50;&#x91CC;&#x8BF4;&#x201C;&#x6211;&#x201D;&#xFF0C;&#x5B81;&#x613F;&#x76F4;&#x63A5;&#x628A;&#x4E3B;&#x8BED;&#x7701;&#x7565;&#x6389;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x6B3A;&#x9A97;&#x81EA;&#x5DF1;&#xFF0C;&#x5220;&#x6389;&#x4E3B;&#x8BED;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F53;&#x6210;&#x662F;&#x5728;&#x8BF4;&#x53E6;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x5C31;&#x4E0D;&#x4F1A;&#x89C9;&#x5F97;&#x90A3;&#x4E48;&#x4E0D;&#x597D;&#x610F;&#x601D;&#x3002;</p>
<hr>
<p>&#x201C;&#x7075;&#x6C14;&#x201D;&#x5E76;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x5BB9;&#x6613;&#x83B7;&#x5F97;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6709;&#x65F6;&#x5019;&#x5199;&#x4E86;&#x5F88;&#x591A;&#x5374;&#x5B8C;&#x5168;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x8BF4;&#x4EC0;&#x4E48;&#xFF0C;&#x6211;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x80FD;&#x628A;&#x81EA;&#x5DF1;&#x82E5;&#x65E0;&#x5176;&#x4E8B;&#x5730;&#x53D9;&#x8FF0;&#x51FA;&#x6765;&#x7684;&#x80FD;&#x529B;&#x3002;&#x9010;&#x6E10;&#x5730;&#x5C31;&#x5F00;&#x59CB;&#x7406;&#x89E3;&#xFF0C;&#x7269;&#x8D28;&#x662F;&#x591A;&#x4E48;&#x62D6;&#x7D2F;&#x7CBE;&#x795E;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x53CD;&#x6B63;&#x559C;&#x6B22;&#x7684;&#x8BDD;&#x603B;&#x662F;&#x88AB;&#x522B;&#x4EBA;&#x8BF4;&#x51FA;&#x53E3;&#x4E86;&#xFF0C;&#x7535;&#x5F71;&#x53F0;&#x8BCD;&#x4E5F;&#x597D;&#x6B4C;&#x8BCD;&#x4E5F;&#x7F62;&#xFF0C;&#x9605;&#x8BFB;&#x603B;&#x662F;&#x6BD4;&#x81EA;&#x5DF1;&#x521B;&#x4F5C;&#x8981;&#x8212;&#x670D;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x53EA;&#x662F;&#x5F88;&#x60F3;&#x542C;&#x522B;&#x4EBA;&#x7684;&#x6545;&#x4E8B;&#x800C;&#x5DF2;&#xFF0C;&#x4EFF;&#x4F5B;&#x662F;&#x8EAB;&#x5904;&#x4E0D;&#x77E5;&#x4F55;&#x5904;&#x7684;&#x68A6;&#x5883;&#x4E2D;&#x4E00;&#x6837;&#x3002;&#x8EAB;&#x8FB9;&#x7684;&#x4E8B;&#x7269;&#x592A;&#x5435;&#x95F9;&#x4E86;&#xFF0C;&#x751F;&#x6D3B;&#x592A;&#x65E0;&#x804A;&#xFF0C;&#x4E5F;&#x592A;&#x5BD2;&#x51B7;&#x3002;</p>
<p>&#x56DB;&#x6708;&#x53EA;&#x662F;&#x6625;&#x5929;&#x7684;&#x8C0E;&#x8A00;&#x5427;&#xFF0C;&#x8FD9;&#x6837;&#x5BD2;&#x51B7;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x6625;&#x5929;&#x771F;&#x7684;&#x6765;&#x4E86;&#x5417;&#xFF1F;&#x8FD8;&#x662F;&#x8BF4;&#x5F00;&#x653E;&#x7684; Magnolia&#xFF0C;&#x53EA;&#x662F;&#x6625;&#x5929;&#x7684;&#x5047;&#x8C61;&#x800C;&#x5DF2;&#x5462;&#xFF1F;</p>
<p><em>AlynxZhou</em></p>
<p><strong>A Coder &amp; Dreamer</strong></p>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/%E9%9A%8F%E8%AE%B0/" rel="tag"><i class="fas fa-tag"></i>随记</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/posts/Android-Video-Wallpaper-Implementation/" rel="prev" title="如何编写 Android 视频壁纸"><span class="nav-title">如何编写 Android 视频壁纸</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
  

<div class="reward" id="reward">
  <p>既然看了喵写的文章，不打算投喂一下再走吗？哼！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>打赏</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechatpay">
      <img id="wechatpay-qr" src="/images/WeChatPay.png" alt="微信支付"/>
      <span>微信支付</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay-qr" src="/images/AliPay.png" alt="支付宝"/>
      <span>支付宝</span>
    </div>
    
    
  </div>
</div>



  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "AlynxZhou",
      "repo": "stackharbor",
      "clientID": "",
      "clientSecret": "6db7dd16477eadc1e96160a23c6ba4cf687dcecf",
      "no_comment": "这个页面还没有评论，现在就去评论吧！",
      "go_to_comment": "去评论",
      "issue_title": "Magnolia",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="搜索" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/Future_Gazer_small.png" alt="Alynx Zhou">
  
  <h1 class="author-name">Alynx Zhou</h1>
  <h2 class="author-description">望むものなら残さず<br>輝ける自分らしさで</h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">归档</div>
      <div><a href="/archives/">55</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">分类</div>
      <div><a href="/categories/">37</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">标签</div>
      <div><a href="/tags/">58</a></div>
    </div>
    
    
    
    
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>社交链接</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:alynx.zhou@gmail.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/AlynxZhou/" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-telegram-plane"></i><a href="https://t.me/AlynxZhou/" target="_blank">Telegram</a></li>
        
        <li><i class="fas fa-video"></i><a href="https://space.bilibili.com/10034969/" target="_blank">Bilibili</a></li>
        
        <li><i class="fab fa-weibo"></i><a href="https://weibo.com/u/5287501461" target="_blank">Weibo</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>友情链接</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://lrscy.github.io/" target="_blank">Meow's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://lgiki.cc/" target="_blank">LGiki's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://hackghost.com/" target="_blank">HackGhost's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://chenxy.moe/" target="_blank">Art_Chen's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jm33.me/" target="_blank">Jm33_m0's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://farseerfc.me/" target="_blank">Farseerfc 的小窝</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://huaji.store/" target="_blank">滑稽仓库</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jitui.moe/" target="_blank">鸡腿工坊</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sh.yorushika.live/" target="_blank">Yorushika Shi's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sqyon.com/" target="_blank">Sqyon's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://blog.yoitsu.moe/" target="_blank">约伊兹的萌狼乡手札</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #33363b;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="回到顶部"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>Alynx Zhou</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-nd/4.0/" target="_blank">BY-NC-ND 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="站点点击量" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="站点用户数" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="页面点击量" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          托管于<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">GitHub Pages</a>
          
        </div>
        <div class="powered-by">
          由 <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a> 强力驱动<i class="fab fa-node-js"></i>主题 <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
<!-- Page built by Hikaru v1.14.1 at 2019-04-08 周一 20:32:53 CST. -->
