<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#33363b">
    <meta name="msapplication-TileColor" content="#33363b">
    
    
    <meta name="google-site-verification" content="VmX1m6eF3rZhAf1iR5DhqrbiF_5se-s902W14pPryQk">
    
    
    <meta name="keywords" content="Code, Music, Life, Linux, Arch Linux, Gentoo, JavaScript, ARIA, Hikaru">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#33363b">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="喵's StackHarbor" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/clipboard.min.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      $(".post pre code figure.highlight").each(function (i, e) {
        $(e).before("<button class=\"copy button\">复制</button>");
      });
      var cb = new ClipboardJS("button.copy", {
        "target": function (trigger) {
            // Get target element by DOM API.
            // nextElementSibling is figure,highlight, lastChild is pre.code.
            return trigger.nextElementSibling.lastChild;
        }
      });
      cb.on("success", function (e) {
        e.clearSelection();
        var trigger = e.trigger;
        // Change button text as a user tip.
        trigger.innerHTML = "已复制";
        $(trigger).addClass("copied");
        // Change button text back;
        setTimeout(function () {
          trigger.innerHTML = "复制";
          $(trigger).removeClass("copied");
        }, 1500);
      });
    });
    </script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>突然更新 | 喵's StackHarbor - Whisper to the World</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="zh_CN" data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #33363b;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">喵's StackHarbor</a></h1>
        <h2 class="subtitle">Whisper to the World</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="切换导航栏"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">首页</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">归档</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">分类</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">标签</span></a></li>
        
        <li role="menuitem"><a href="/Undefined-Shell-Works/"><i class="fas fa-terminal"></i><span class="menu-text">Undefined Shell Works!</span></a></li>
        
        <li role="menuitem"><a href="/blogroll/"><i class="fas fa-link"></i><span class="menu-text">友情链接</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">关于</span></a></li>
        
      </ul>
    </nav>
  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card animate" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://sh.alynx.xyz/posts/An-Update/">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="Alynx Zhou">
        <meta itemprop="description" content="Everything that lives is designed to end.">
        <meta itemprop="image" content="/images/Future_Gazer_small.png">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="喵's StackHarbor">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">突然更新</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2017-05-30T07:14:51.000Z">2017-05-30 周二 15:14:51 CST</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/" itemprop="url" rel="index"><span itemprop="name">随记</span></a></span><i class="fas fa-angle-right"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/%E6%97%A0%E9%A2%98/" itemprop="url" rel="index"><span itemprop="name">无题</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <blockquote class="centerquote">&#x8C28;&#x4EE5;&#x8FD9;&#x7BC7;&#x6CA1;&#x8425;&#x517B;&#x7684;&#x66F4;&#x65B0;&#x8868;&#x660E;&#x6211;&#x73B0;&#x5728;&#x95F2;&#x7740;&#x3002;</blockquote>

<p>&#x561B;&#xFF0C;&#x597D;&#x4E45;&#x4E0D;&#x89C1;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x90A3;&#x53EA;&#x7339;&#x55B5;<em>Alynx</em>&#xFF0C;&#x672C;&#x7740;&#x6211;&#x4E00;&#x5411;&#x8BDA;&#x5B9E;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x4E11;&#x8BDD;&#x8BF4;&#x5728;&#x524D;&#x5934;&#xFF0C;&#x8FD9;&#x7BC7;&#x95F4;&#x9694;&#x8BB8;&#x4E45;&#x7684;&#x66F4;&#x65B0;&#x6CE8;&#x5B9A;&#x662F;&#x6CA1;&#x8425;&#x517B;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x73CD;&#x60DC;&#x4F60;&#x7684;&#x6D41;&#x91CF;&#x7684;&#x8BDD;&#x2014;&#x2014;</p>
<p>Windows&#x7528;&#x6237;/&#x5927;&#x90E8;&#x5206;Linux&#x7528;&#x6237;&#x8BF7;&#x6309;&#x53F3;&#x4E0A;&#x89D2;X&#xFF0C;macOS&#x7528;&#x6237;/Ubuntu&#x7528;&#x6237;/&#x81EA;&#x5DF1;&#x504F;&#x8981;&#x628A;&#x5173;&#x95ED;&#x6309;&#x94AE;&#x632A;&#x5230;&#x5DE6;&#x9762;&#x7684;&#x7528;&#x6237;&#x8BF7;&#x6309;&#x5DE6;&#x4E0A;&#x89D2;X&#xFF0C;Android/iOS&#x7528;&#x6237;&#x8BF7;&#x6309;home&#x952E;&#x5E76;&#x628A;&#x60A8;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4ECE;&#x591A;&#x4EFB;&#x52A1;&#x754C;&#x9762;&#x9664;&#x53BB;&#x3002;Windows Phone&#x7528;&#x6237;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x8BF7;&#x628A;&#x624B;&#x673A;&#x6454;&#x6389;&#xFF0C;&#x5E76;&#x611F;&#x8C22;&#x6211;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x5FAE;&#x8F6F;&#x7238;&#x7238;&#xFF09;&#x7ED9;&#x4E86;&#x4F60;&#x4E00;&#x4E2A;&#x51A0;&#x5195;&#x5802;&#x7687;&#x6362;Android/iOS&#x8BBE;&#x5907;&#x7684;&#x7406;&#x7531;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x8FD8;&#x6CA1;&#x6709;&#x575A;&#x5B9A;&#x60A8;&#x7684;&#x51B3;&#x5FC3;&#xFF0C;&#x5B9E;&#x9A8C;&#x4E03;&#x5199;&#x5B8C;&#x4E86;&#x5417;&#xFF1F;&#x5B9E;&#x9A8C;&#x4E03;50&#x9875;&#x7684;&#x5751;&#x7239;&#x8BF4;&#x660E;&#x90FD;&#x770B;&#x61C2;&#x5566;&#xFF1F;&#x6CA1;&#x770B;&#x61C2;&#x8FD8;&#x4E0D;&#x8D76;&#x7D27;&#x628A;&#x4F60;&#x6253;&#x5370;&#x51FA;&#x6765;&#x7684;&#x5B9E;&#x9A8C;&#x4E03;&#x8BF4;&#x660E;&#x6495;&#x4E86;&#xFF0C;&#x56DE;&#x53BB;&#x9AD8;&#x4E2D;&#x627E;&#x4F60;&#x7684;&#x8BED;&#x6587;&#x8001;&#x5E08;&#x627F;&#x8BA4;&#x6CA1;&#x597D;&#x597D;&#x5B66;&#x4E60;&#x8BED;&#x6587;&#x7684;&#x9519;&#x8BEF;&#xFF01;</p>
<p>&#x987A;&#x4FBF;&#x8865;&#x5145;&#x4E00;&#x53E5;&#x628A;&#x8FD9;&#x79CD;&#x5783;&#x573E;&#x5B9E;&#x9A8C;&#x8BF4;&#x660E;&#x6253;&#x5370;&#x51FA;&#x6765;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5BF9;&#x6811;&#x6728;&#x7684;&#x4E0D;&#x5C0A;&#x91CD;&#x4E86;&#xFF0C;&#x4F60;&#x770B;&#x6211;&#x77E5;&#x9053;&#x6211;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x5F88;&#x5783;&#x573E;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x6253;&#x5370;&#x7EB8;&#x8D28;&#x7248;&#xFF0C;&#x90FD;&#x662F;&#x653E;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x505A;&#x7535;&#x5B50;&#x7248;&#x3002;</p>
<a id="more"></a>

<p>&#x5982;&#x679C;&#x4F60;&#x6210;&#x529F;&#x8D8A;&#x8FC7;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x91CD;&#x91CD;&#x6311;&#x6218;&#xFF0C;&#x5F88;&#x597D;&#xFF0C;<del>&#x548C;&#x6211;&#x4E00;&#x8D77;&#x6253;&#x5F00;Steam&#xFF0C;&#x6765;&#x4E00;&#x76D8;&#x7D27;&#x5F20;&#x523A;&#x6FC0;&#x7684;CS:GO/Dota2&#xFF0C;&#x4ECA;&#x5929;&#x7684;&#x66F4;&#x65B0;&#x5230;&#x6B64;&#x7ED3;&#x675F;&#xFF0C;&#x8C22;&#x8C22;&#x5927;&#x5BB6;&#x3002;</del>&#x8BA9;&#x6211;&#x4EEC;&#x5F80;&#x4E0B;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x662F;&#xFF08;&#x65E5;&#x671F;&#x81EA;&#x5DF1;&#x770B;&#x53D1;&#x5E03;&#x65E5;&#x671F;&#xFF01;&#xFF09;&#x591A;&#x4E91;&#x8F6C;&#x6674;&#xFF0C;&#x7A7A;&#x6C14;&#x8FD8;&#x662F;&#x51C9;&#x723D;&#x7684;&#xFF0C;&#x96BE;&#x5F97;&#x7684;&#x597D;&#x5929;&#x6C14;&#xFF0C;&#x867D;&#x7136;&#x8D70;&#x5728;&#x5916;&#x9762;&#x8FD8;&#x662F;&#x4F1A;&#x51FA;&#x70B9;&#x6C57;&#x3002;</p>
<p>&#x676F;&#x5B50;&#x91CC;&#x7684;&#x51B0;&#x5496;&#x5561;&#x5728;&#x51B0;&#x5757;&#x5316;&#x5F00;&#x4E4B;&#x540E;&#x7A00;&#x91CA;&#x6210;&#x4E86;&#x7EA2;&#x8336;&#x822C;&#x7684;&#x989C;&#x8272;&#x3002;</p>
<p><strong>&#x201C;&#x4E0B;&#x9762;&#x63D2;&#x64AD;&#x4E00;&#x6761;&#x65B0;&#x95FB;&#xFF0C;&#x60A8;&#x6B63;&#x5728;&#x9605;&#x8BFB;&#x7684;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7531;&#x4E8E; 1. &#x5199;&#x4F5C;&#x8005;&#x64AD;&#x653E;&#x5668;&#x64AD;&#x653E;&#x7684;&#x97F3;&#x4E50;&#x4E0D;&#x5BF9; 2. &#x5199;&#x4F5C;&#x8005;&#x56F0;&#x4E86;&#x60F3;&#x7761;&#x89C9;&#x4E86; 3. &#x5199;&#x4F5C;&#x8005;&#x7684;&#x8F93;&#x5165;&#x6CD5;&#x7F62;&#x5DE5;&#x4E86; &#x800C;&#x63A8;&#x8FDF;&#x66F4;&#x65B0;&#x65E5;&#x671F;&#x5230;&#x65E0;&#x9650;&#x671F;&#x3002;&#x201D;</strong></p>
<p>&#xFF08;&#x641E;&#x4EC0;&#x4E48;&#x554A;&#xFF01;&#x73B0;&#x5728;&#x7684;&#x65B0;&#x95FB;&#x90FD;&#x8FD9;&#x4E48;&#x6CA1;&#x52B2;&#x4E86;&#x554A;&#xFF01;&#x9A97;&#x9B3C;&#x5462;&#xFF01;&#xFF09;</p>
<p>&#x53EF;&#x662F;&#x4E5F;&#x8BB8;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x672C;&#x6765;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x60F3;&#x8BF4;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x6211;&#x80FD;&#x5728;&#x8FD9;&#x91CC;&#x5199;&#x51FA;&#x6765;&#x70B9;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x771F;&#x7684;&#x8BE5;&#x611F;&#x8C22;&#x4ECE;&#x5C0F;&#x5B66;&#x5230;&#x9AD8;&#x4E2D;&#x7684;&#x8BED;&#x6587;&#x8001;&#x5E08;&#x4EEC;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x6211;&#x4E0D;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x6709;&#x6587;&#x5B66;&#x5929;&#x8D4B;&#x7684;&#x5B66;&#x751F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x4E5F;&#x88AB;&#x6211;&#x653E;&#x5230;&#x4EE3;&#x7801;&#x91CC;&#x9762;&#x4E86;&#x3002;</p>
<p>&#x8BF4;&#x6B63;&#x7ECF;&#x7684;&#xFF0C;&#x4ECE;&#x4E0A;&#x4E00;&#x6B21;&#x66F4;&#x65B0;&#x5230;&#x8FD9;&#x6B21;&#x66F4;&#x65B0;&#x7684;&#x6F2B;&#x957F;&#x65F6;&#x95F4;&#x91CC;&#x6211;&#x90FD;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#xFF08;&#x89C2;&#x4F17;&#xFF1A;&#x6211;&#x4EEC;&#x5BF9;&#x4F60;&#x5403;&#x4E86;&#x5565;&#x559D;&#x4E86;&#x5565;&#x548C;&#x673A;&#x53CB;&#x641E;&#x4E86;&#x5565;&#x6CA1;&#x5174;&#x8DA3;&#xFF01;&#x9A97;&#x4EBA;&#x5462;&#x8FD9;&#x4E0D;&#x662F;&#xFF01;&#x6211;&#xFF1A;&#x8BF4;&#x5B9E;&#x8BDD;&#x6211;&#x5BF9;&#x6211;&#x5403;&#x4E86;&#x5565;&#x4E5F;&#x6CA1;&#x5174;&#x8DA3;&#xFF0C;&#x6BD5;&#x7ADF;&#x4E1C;&#x533A;&#x98DF;&#x5802;&#x5C31;&#x5270;&#x90A3;&#x4E48;&#x4E24;&#x6837;&#x80FD;&#x5403;&#x7684;&#x4E86;&#x3002;&#xFF09;</p>
<p>&#x4E0A;&#x4E2A;&#x53EF;&#x601C;&#x7684;&#x4E09;&#x5929;&#x5047;&#x671F;&#x82B1;&#x4E86;&#x4E24;&#x5929;&#x65F6;&#x95F4;&#x4ECE;pt&#x4E0A;&#x62D6;&#x4E0B;&#x4E86;&#x9AD8;&#x6E05;&#x7684;EVA&#xFF0C;&#x5360;&#x636E;&#x4E86;&#x6211;&#x76F8;&#x5F53;&#x53EF;&#x89C2;&#x7684;&#x4E00;&#x5757;&#x786C;&#x76D8;&#x7A7A;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x8FD9;&#x4E2A;&#x5957;&#x7740;&#x70ED;&#x8840;OP&#x5B9E;&#x9645;&#x662F;&#x5BFC;&#x6F14;&#x4F5C;&#x6B7B;&#x7684;&#x610F;&#x8BC6;&#x6D41;&#x795E;&#x4F5C;&#x770B;&#x5B8C;&#x4E86;&#x3002;TV + &#x65E7;&#x5267;&#x573A;&#x7248;&#xFF08;&#x6700;&#x540E;&#x90A3;&#x4E2A;&#x5927;&#x767D;&#x4E3D;&#x6C42;&#x5BFC;&#x6F14;&#x522B;&#x5413;&#x5B9D;&#x5B9D;&#x4E86;&#x884C;&#x4E0D;&#xFF09; + &#x4E09;&#x90E8;&#x65B0;&#x5267;&#x573A;&#x7248;&#x3002;</p>
<p><strong>&#x201C;&#x798F;&#x97F3;&#x6218;&#x58EB;&#x65B0;&#x5267;&#x573A;&#x7248;:||&#xFF0C;&#x73B0;&#x5DF2;&#x4E0E; &#x79D1;&#x5B66;&#x8D85;&#x7535;&#x78C1;&#x70AE;3/&#x79D1;&#x5B66;&#x8D85;&#x7535;&#x78C1;&#x70AE;&#x5267;&#x573A;&#x7248; &#x4E00;&#x8D77;&#x52A0;&#x5165;&#x60A8;&#x7684;&#x6709;&#x751F;&#x4E4B;&#x5E74;&#x5957;&#x9910;&#xFF01;&#x201D;</strong></p>
<p>&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x4E0D;&#x8BC4;&#x4EF7;&#x4E86;&#xFF0C;&#x6BD5;&#x7ADF;EVA&#x7684;&#x5206;&#x6790;&#x5DF2;&#x7ECF;&#x6709;&#x597D;&#x591A;&#x4E86;&#xFF0C;&#x6211;&#x81EA;&#x89C9;&#x6CA1;&#x6709;&#x90A3;&#x4E2A;&#x6C34;&#x5E73;&#xFF0C;&#x4F60;&#x8BF4;&#x6211;&#x7684;&#x611F;&#x53D7;&#xFF1F;&#x4E0A;&#x9762;&#x90A3;&#x53E5;&#x8FD8;&#x4E0D;&#x591F;&#x5417;&#xFF1F;</p>
<p>&#x8FD9;&#x4E2A;&#x53EF;&#x601C;&#x7684;&#x5047;&#x671F;&#x5219;&#x662F;&#x6628;&#x5929;&#x534A;&#x591C;&#x770B;&#x4E86;&#x4E0B;&#x8F7D;&#x597D;&#x7684;&#x653B;&#x58F3;&#x673A;&#x52A8;&#x961F;2017&#xFF0C;&#x53C8;&#x628A;&#x53EF;&#x601C;&#x7684;&#x5B9D;&#x5B9D;&#x5413;&#x5F97;&#x4E0D;&#x8F7B;&#xFF08;&#x522B;&#x5ACC;&#x5F03;&#x55B5;&#x786E;&#x5B9E;&#x6BD4;&#x770B;&#x4E0A;&#x53BB;&#x8981;&#x80C6;&#x5B50;&#x5C0F;&#xFF0C;&#x6C42;&#x62B1;&#x62B1;&#xFF09;&#x3002;&#x597D;&#x5728;&#x770B;&#x5B8C;&#x8FD9;&#x4E2A;&#x6CA1;&#x6709;&#x8BA9;&#x6211;&#x4EA7;&#x751F;&#x8865;&#x756A;&#x7684;&#x51B2;&#x52A8;&#x3002;</p>
<p>&#xFF08;&#x96BE;&#x9053;&#x4F60;&#x8FD9;&#x4E48;&#x591A;&#x5929;&#x4E0D;&#x66F4;&#x65B0;&#x9664;&#x4E86;&#x770B;&#x756A;&#x770B;&#x7535;&#x5F71;&#x5C31;&#x6CA1;&#x5E72;&#x522B;&#x7684;&#x561B;&#xFF01;&#xFF01;&#xFF01;&#xFF09;</p>
<p>&#x5F53;&#x7136;&#x6709;&#x554A;&#xFF0C;&#x5199;&#x90A3;&#x4E2A;&#x8BE5;&#x6B7B;&#x7684;&#x5B9E;&#x9A8C;&#x4E03;&#x561B;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x5199;&#x5B8C;&#x5462;&#x8FD8;&#xFF08;&#x61D2;&#xFF09;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x51C6;&#x5907;&#x53E3;&#x7434;&#x793E;&#x56E2;&#x7684;&#x5EFA;&#x7ACB;&#x554A;&#xFF0C;&#x7EC8;&#x4E8E;&#x5F00;&#x59CB;&#x6B65;&#x4E0A;&#x6B63;&#x8F68;&#x4E86;&#xFF0C;&#x5EFA;&#x6210;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x9700;&#x8981;&#x4EBA;&#x6367;&#x573A;&#x5462;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x76F4;&#x64AD;&#x554A;&#xFF0C;&#x521D;&#x751F;&#x725B;&#x728A;&#x4E0D;&#x6015;&#x864E;&#x7684;&#x5728;B&#x7AD9;&#x5F55;C&#x8BED;&#x8A00;&#x5165;&#x95E8;&#x6559;&#x7A0B;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x539F;&#x56E0;&#x561B;&#xFF0C;&#x563F;&#x563F;&#x563F;&#x563F;&#x563F;&#x4E0D;&#x544A;&#x8BC9;&#x4F60;&#x4EEC;&#x3002;</p>
<p>&#x60F3;&#x770B;&#x7684;&#x70B9;&#x51FB;<a href="http://space.bilibili.com/10034969/#!/" target="_blank">&#x8FD9;&#x91CC;</a>&#x4E5F;&#x8BB8;&#x80FD;&#x8BBF;&#x95EE;&#x5230;&#x6211;&#x7684;Bilibili&#x4E3B;&#x9875;&#x3002;</p>
<p>&#xFF08;&#x6240;&#x4EE5;&#x4F60;&#x4ECA;&#x5929;&#x5199;&#x8FD9;&#x4E2A;&#x66F4;&#x65B0;&#x5230;&#x5E95;&#x662F;&#x8981;&#x5E72;&#x5565;&#x554A;&#xFF01;&#xFF09;</p>
<p>&#x4E0D;&#x5E72;&#x5565;&#x554A;&#xFF0C;&#x8868;&#x793A;&#x6211;&#x73B0;&#x5728;&#xFF08;&#x4EC5;&#x4EC5;&#x662F;&#x73B0;&#x5728;&#xFF09;&#x5F88;&#x95F2;&#xFF08;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5FC3;&#x91CC;&#x60F3;&#x5077;&#x61D2;&#xFF09;&#x554A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x771F;&#x7684;&#x60F3;&#x770B;&#x4E25;&#x8083;&#x7684;/&#x6587;&#x5B66;&#x6027;&#x7684;/&#x6280;&#x672F;&#x6D41;&#x7684;/&#x97F3;&#x4E50;&#x5411;&#x7684;&#xFF0C;&#x653E;&#x5FC3;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4F1A;&#x7763;&#x4FC3;&#x81EA;&#x5DF1;&#x5F80;&#x4E0B;&#x5199;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x957F;&#x65F6;&#x95F4;&#x65AD;&#x66F4;&#x4E86;&#x3002;</p>
<p>&#x54E6;&#x5BF9;&#xFF0C;&#x5FEB;&#x8981;&#x9AD8;&#x8003;&#x4E86;&#x662F;&#x5427;&#x3002;&#x9001;&#x7ED9;&#x5B66;&#x5F1F;&#x5B66;&#x59B9;&#x4EEC;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x8003;&#x8BD5;&#x653E;&#x677E;&#x70B9;&#xFF0C;&#x62A5;&#x5FD7;&#x613F;&#x8C28;&#x614E;&#x70B9;&#x3002;</p>
<p>&#x6BD5;&#x7ADF;&#x4F60;&#x8981;&#x8003;&#x8BD5;&#x7D27;&#x5F20;&#x4E86;&#x6CA1;&#x53D1;&#x6325;&#x597D;&#xFF0C;&#x62A5;&#x5FD7;&#x613F;&#x518D;&#x4E0D;&#x4E0A;&#x5FC3;&#xFF0C;&#x4ECA;&#x5E74;8&#x6708;&#x4EFD;&#x4F60;&#x53EF;&#x80FD;&#x5C31;&#x5728;&#x5317;&#x4EA4;&#x5927;&#x519B;&#x8BAD;&#x54AF;&#xFF08;&#x7B11;&#x54ED;&#xFF09;&#xFF0C;&#x867D;&#x7136;17&#x5C4A;&#x5728;&#x5B66;&#x6821;&#x519B;&#x8BAD;&#x4E0D;&#x7528;&#x53BB;&#x6000;&#x67D4;&#x4E5F;&#x6CA1;&#x6709;&#x6563;&#x8BAD;&#xFF08;&#x6028;&#x5FF5;&#x554A;&#xFF01;&#xFF09;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x4EEC;&#x8FD8;&#x6709;&#x6708;&#x8003;&#x554A;&#xFF01;&#x8FD8;&#x6709;&#x9664;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x4E0E;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x4EC0;&#x4E48;&#x90FD;&#x5B66;&#x5C31;&#x662F;&#x4E0D;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x4E0E;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0E;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x5B66;&#x9662;&#x554A;&#xFF08;&#x4EC5;&#x9650;&#x5927;&#x4E00;&#x5927;&#x7C7B;&#x62DB;&#x751F;&#xFF09;&#xFF01;&#x8FD8;&#x6709;&#x6211;&#x4EEC;&#x5047;&#x671F;&#x5C11;&#x554A;&#xFF01;</p>
<p>&#x73A9;&#x7B11;&#x5F52;&#x73A9;&#x7B11;&#xFF0C;&#x8BE5;&#x8003;&#x8651;&#x7684;&#x8FD8;&#x662F;&#x8981;&#x597D;&#x597D;&#x8003;&#x8651;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x4F60;&#x6D3B;&#x7740;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x53EA;&#x4E3A;&#x4E86;&#x5B66;&#x4E60;&#x6216;&#x8005;&#x5DE5;&#x4F5C;&#xFF0C;&#x76F8;&#x53CD;&#xFF0C;&#x5DE5;&#x4F5C;&#x548C;&#x5B66;&#x4E60;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x751F;&#x6D3B;&#x3002;</p>
<p><a href="/posts/2017/05/30/Encrypt-for-the-Update/">&#x53EF;&#x662F;&#x6211;&#x5DF2;&#x7ECF;&#x8003;&#x5B8C;&#x4E86;&#x554A;&#xFF0C;&#x6211;&#x8FD8;&#x7EA0;&#x7ED3;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</a></p>
<p>&#x90A3;&#x4E48;&#x4ECA;&#x5929;&#x8FD9;&#x4E2A;&#x6CA1;&#x8425;&#x517B;&#x7684;&#x66F4;&#x65B0;&#x5C31;&#x8FD9;&#x6837;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x9965;&#x997F;&#x7684;&#x7339;&#x55B5;&#x8981;&#x53BB;&#x89C5;&#x98DF;&#x5E76;&#x51C6;&#x5907;&#x4ECA;&#x665A;&#x7684;&#x76F4;&#x64AD;&#x4E86;&#x3002;</p>
<p><em>AlynxZhou</em></p>
<p><strong>A Coder &amp; Dreamer</strong></p>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/%E9%9A%8F%E8%AE%B0/" rel="tag"><i class="fas fa-tag"></i>随记</a><a class="post-tag button" href="/tags/%E6%97%A0%E9%A2%98/" rel="tag"><i class="fas fa-tag"></i>无题</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
      <a href="/posts/Encrypt-for-the-Update/" rel="next" title="Encrypted for the Update."><i class="fas fa-angle-left"></i><span class="nav-title">Encrypted for the Update.</span></a>
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/posts/Grey-Valentine-s-Day/" rel="prev" title="灰色情人节"><span class="nav-title">灰色情人节</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
  

<div class="reward" id="reward">
  <p>既然看了喵写的文章，不打算投喂一下再走吗？哼！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>打赏</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechatpay">
      <img id="wechatpay-qr" src="/images/WeChatPay.png" alt="微信支付"/>
      <span>微信支付</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay-qr" src="/images/AliPay.png" alt="支付宝"/>
      <span>支付宝</span>
    </div>
    
    
  </div>
</div>



  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "AlynxZhou",
      "repo": "stackharbor",
      "clientID": "",
      "clientSecret": "6db7dd16477eadc1e96160a23c6ba4cf687dcecf",
      "no_comment": "这个页面还没有评论，现在就去评论吧！",
      "go_to_comment": "去评论",
      "issue_title": "突然更新",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="搜索" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/Future_Gazer_small.png" alt="Alynx Zhou">
  
  <h1 class="author-name">Alynx Zhou</h1>
  <h2 class="author-description">Everything that lives is designed to end.</h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">归档</div>
      <div><a href="/archives/">53</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">分类</div>
      <div><a href="/categories/">39</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">标签</div>
      <div><a href="/tags/">62</a></div>
    </div>
    
    
    
    
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>社交链接</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:alynx.zhou@gmail.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/AlynxZhou/" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-telegram-plane"></i><a href="https://t.me/AlynxZhou/" target="_blank">Telegram</a></li>
        
        <li><i class="fas fa-video"></i><a href="https://space.bilibili.com/10034969/" target="_blank">Bilibili</a></li>
        
        <li><i class="fab fa-weibo"></i><a href="https://weibo.com/u/5287501461" target="_blank">Weibo</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>友情链接</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://lrscy.github.io/" target="_blank">Meow's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://lgiki.cc/" target="_blank">LGiki's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://hackghost.com/" target="_blank">HackGhost's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://chenxy.moe/" target="_blank">Art_Chen's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jm33.me/" target="_blank">Jm33_m0's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://farseerfc.me/" target="_blank">Farseerfc 的小窝</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://huaji.store/" target="_blank">滑稽仓库</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jitui.moe/" target="_blank">鸡腿工坊</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sh.yorushika.live/" target="_blank">Yorushika Shi's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sqyon.com/" target="_blank">Sqyon's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://blog.yoitsu.moe/" target="_blank">约伊兹的萌狼乡手札</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #33363b;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="回到顶部"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>Alynx Zhou</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-nd/4.0/" target="_blank">BY-NC-ND 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="站点点击量" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="站点用户数" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="页面点击量" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          托管于<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">GitHub Pages</a>
          
        </div>
        <div class="powered-by">
          由 <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a> 强力驱动<i class="fab fa-node-js"></i>主题 <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
<!-- Page built by Hikaru v1.13.7 at 2019-03-18 周一 15:25:13 CST. -->
