<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#33363b">
    <meta name="msapplication-TileColor" content="#33363b">
    
    
    <meta name="google-site-verification" content="VmX1m6eF3rZhAf1iR5DhqrbiF_5se-s902W14pPryQk">
    
    
    <meta name="keywords" content="Code, Music, Life, Linux, Arch Linux, Gentoo, JavaScript, ARIA, Hikaru">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#33363b">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="喵's StackHarbor" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/clipboard.min.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      $(".post pre code figure.highlight").each(function (i, e) {
        $(e).before("<button class=\"copy button\">复制</button>");
      });
      var cb = new ClipboardJS("button.copy", {
        "target": function (trigger) {
            // Get target element by DOM API.
            // nextElementSibling is figure,highlight, lastChild is pre.code.
            return trigger.nextElementSibling.lastChild;
        }
      });
      cb.on("success", function (e) {
        e.clearSelection();
        var trigger = e.trigger;
        // Change button text as a user tip.
        trigger.innerHTML = "已复制";
        $(trigger).addClass("copied");
        // Change button text back;
        setTimeout(function () {
          trigger.innerHTML = "复制";
          $(trigger).removeClass("copied");
        }, 1500);
      });
    });
    </script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>在中国 Android 环境下传个 APK 有多难 | 喵's StackHarbor - Whisper to the World</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="zh_CN" data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #33363b;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">喵's StackHarbor</a></h1>
        <h2 class="subtitle">Whisper to the World</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="切换导航栏"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">首页</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">归档</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">分类</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">标签</span></a></li>
        
        <li role="menuitem"><a href="/Undefined-Shell-Works/"><i class="fas fa-terminal"></i><span class="menu-text">Undefined Shell Works!</span></a></li>
        
        <li role="menuitem"><a href="/blogroll/"><i class="fas fa-link"></i><span class="menu-text">友情链接</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">关于</span></a></li>
        
      </ul>
    </nav>
  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card animate" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://sh.alynx.xyz/posts/Hard-to-Transfer-APK-with-Chinese-Android/">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="Alynx Zhou">
        <meta itemprop="description" content="望むものなら残さず<br>輝ける自分らしさで">
        <meta itemprop="image" content="/images/Future_Gazer_small.png">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="喵's StackHarbor">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">在中国 Android 环境下传个 APK 有多难</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2019-03-18T06:47:00.000Z">2019-03-18 周一 14:47:00 CST</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/Dirty%20words/" itemprop="url" rel="index"><span itemprop="name">Dirty words</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <p>&#x4E8B;&#x60C5;&#x7684;&#x8D77;&#x56E0;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x6211;&#x5199;&#x4E86; <a href="https://livewallpaper.alynx.xyz" target="_blank">&#x4E00;&#x4E2A; Android App</a>&#xFF0C;&#x6253;&#x7B97;&#x628A;&#x5B83;&#x53D1;&#x7ED9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x8BD5;&#x7528;&#xFF0C;&#x53D1;&#x7ED9;&#x540C;&#x5B66;&#x4EC0;&#x4E48;&#x7684;&#x90FD;&#x597D;&#x8BF4;&#xFF0C;&#x4F46;&#x6211;&#x60F3;&#x53D1;&#x7ED9;&#x6211;&#x5988;&#x7528;&#x7684;&#x65F6;&#x5019;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x6070;&#x597D;&#x53EF;&#x4EE5;&#x8BF4;&#x4E00;&#x4E0B;&#x5728;&#x56FD;&#x5185;&#x7528; Android &#x73AF;&#x5883;&#x662F;&#x591A;&#x4E48;&#x75DB;&#x82E6;&#x3002;</p>
<a id="more"></a>

<p>&#x9996;&#x5148;&#x5C1D;&#x8BD5;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;<strong>&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6709; QQ&#xFF0C;&#x4F46;&#x5DEE;&#x4E0D;&#x591A;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6709;&#x5FAE;&#x4FE1;</strong>&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E00;&#x4E9B;&#x4E2D;&#x5E74;&#x7684;&#x4EB2;&#x621A;&#xFF0C;&#x6240;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x5FAE;&#x4FE1;&#x91CC;&#x4F20;&#x9001; APK &#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5931;&#x8D25;&#x4E86;&#x3002;<strong>&#x5FAE;&#x4FE1;&#x81EA;&#x4F5C;&#x806A;&#x660E;&#x5730;&#x7ED9; APK &#x52A0;&#x4E86; <code>.1</code> &#x7684;&#x540E;&#x7F00;&#x540D;&#xFF0C;&#x4E0D;&#x7528;&#x60F3;&#x90FD;&#x77E5;&#x9053;&#x7406;&#x7531;&#xFF1A;&#x201C;&#x54CE;&#x5440;&#x6211;&#x4EEC;&#x7684;&#x7528;&#x6237;&#x90FD;&#x662F;&#x53EF;&#x7231;&#x7684;&#x5565;&#x90FD;&#x4E0D;&#x4F1A;&#x7684;&#x5C0F;&#x5B9D;&#x5B9D;&#xFF0C;&#x8981;&#x4E3A;&#x4E86;&#x4ED6;&#x4EEC;&#x5B89;&#x5168;&#x8003;&#x8651;&#x5462;&#x201D;&#x3002;</strong></p>
<p>&#x5FAE;&#x4FE1;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x6362;&#x4E2A;&#x65B9;&#x5F0F;&#x5427;&#xFF0C;&#x53D1;&#x4E2A;&#x7F51;&#x5740;&#x53BB;&#x4E0B;&#x8F7D; APK&#xFF0C;&#x5E94;&#x8BE5;&#x5C31;&#x4E0D;&#x4F1A;&#x88AB;&#x6539;&#x540D;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x76F4;&#x63A5;&#x590D;&#x5236;&#x4E86; GitHub Release &#x7684;&#x94FE;&#x63A5;&#xFF0C;&#x7136;&#x540E;&#x5927;&#x5BB6;&#x4E00;&#x6982;&#x56DE;&#x590D;&#xFF1A;&#x201C;&#x8FD9;&#x4E2A;&#x7F51;&#x5740;&#x6253;&#x4E0D;&#x5F00;&#x201D;&#x3002;</p>
<p>&#x884C;&#x5427;&#xFF0C;&#x5F00;&#x4E2A; GitHub &#x90FD;&#x8981;&#x6298;&#x817E;&#x6765;&#x6298;&#x817E;&#x53BB;&#x7684;&#x5730;&#x65B9;&#x5B66;&#x4E60;&#x5199;&#x4EE3;&#x7801;&#x6709;&#x591A;&#x8270;&#x96BE;&#x6211;&#x5C31;&#x4E0D;&#x54ED;&#x8BC9;&#x4E86;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x6362;&#x4E2A;&#x7F51;&#x7AD9;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x4E24;&#x4E2A;&#x6708;&#x524D;&#x9177;&#x5B89;&#x7F51;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x4E0B;&#x8F7D; APK &#x7684;&#xFF0C;&#x6211;&#x5C31;&#x628A;&#x6211;&#x4E0A;&#x67B6;&#x4E4B;&#x540E;&#x7684;&#x94FE;&#x63A5;&#x53D1;&#x4E86;&#x8FC7;&#x53BB;&#x3002;&#x4E0D;&#x4E00;&#x4F1A;&#x6211;&#x5988;&#x8BF4;&#xFF1A;&#x201C;&#x4F60;&#x8FD9;&#x4E2A;&#x94FE;&#x63A5;&#x8BA9;&#x6211; <strong>&#x4E0B;&#x8F7D;&#x4ED6;&#x7684;&#x90A3;&#x4E2A;&#x5E02;&#x573A;</strong>&#xFF0C;&#x7136;&#x540E; <strong>&#x5FAE;&#x4FE1;&#x91CC;&#x8981;&#x4E0B;&#x8F7D;&#x8FD8;&#x5F97;&#x88C5; QQ &#x6D4F;&#x89C8;&#x5668;</strong>&#x201D;&#xFF0C;&#x6211;&#x5988;&#x8FD8;&#x662F;&#x6709;&#x5728;&#x8FD9;&#x4E2A;&#x8270;&#x96BE;&#x73AF;&#x5883;&#x4E0B;&#x4F7F;&#x7528;&#x624B;&#x673A;&#x7535;&#x8111;&#x7684;&#x77E5;&#x8BC6;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x770B;&#x5230;&#x8981;&#x88C5;&#x8FD9;&#x4E9B;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#x3002;</p>
<p>&#x6253;&#x5F00;&#x7535;&#x8111;&#x4E00;&#x770B;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x554A;&#x6CA1;&#x60F3;&#x5230;&#xFF0C;&#x9177;&#x5B89;&#x4F60;&#x8FD9;&#x4E2A;&#x6D53;&#x7709;&#x5927;&#x773C;&#x7684;&#x5BB6;&#x4F19;&#x4E5F;&#x53DB;&#x53D8;&#x9769;&#x547D;&#x4E86;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x54EA;&#x4E2A;&#x95F2;&#x9C7C;&#x7528;&#x591A;&#x4E86;&#x81EA;&#x5DF1;&#x8111;&#x888B;&#x90FD;&#x54B8;&#x4E86;&#x7684;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x4E00;&#x62CD;&#x8111;&#x888B;&#x5220;&#x6389;&#x4E86;&#x7F51;&#x7AD9;&#x7684;&#x641C;&#x7D22;&#x6846;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x5173;&#x6389;&#x4E86; APK &#x7684;&#x4E0B;&#x8F7D;&#x6E20;&#x9053;&#x3002;&#x4E3A;&#x4E86;&#x79C9;&#x6301;&#x4F18;&#x96C5;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x95EE;&#x5019;&#x8FD9;&#x4E2A;&#x7ECF;&#x7406;&#x7684;&#x5BB6;&#x4EBA;&#x4E86;&#x3002;</p>
<p>&#x4E8B;&#x5DF2;&#x81F3;&#x6B64;&#xFF0C;&#x603B;&#x4E0D;&#x80FD;&#x7528;&#x767E;&#x5EA6;&#x4E91;&#x5427;&#xFF1F;&#x9760;&#x767E;&#x5EA6;&#x4E91;&#x7684;&#x9650;&#x901F;&#x4F30;&#x8BA1;&#x80FD;&#x4E0B;&#x8F7D;&#x5230;&#x7334;&#x5E74;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x767E;&#x5EA6;&#x9664;&#x4E86;&#x7ADE;&#x4EF7;&#x6392;&#x540D;&#x6280;&#x672F;&#xFF0C;&#x7F51;&#x76D8;&#x9650;&#x901F;&#x6280;&#x672F;&#x4E5F;&#x662F;&#x72EC;&#x6B65;&#x5168;&#x7403;&#xFF0C;&#x800C;&#x4E14;&#x4F3C;&#x4E4E;&#x767E;&#x5EA6;&#x4E91;&#x7A0D;&#x5FAE;&#x5927;&#x4E00;&#x70B9;&#x7684;&#x6587;&#x4EF6;&#x5C31;&#x8BA9;&#x4F60;&#x4E0B;&#x5BA2;&#x6237;&#x7AEF;&#xFF1F;&#x867D;&#x7136;&#x6211;&#x5BF9;&#x6211;&#x5E94;&#x7528;&#x7684;&#x4F53;&#x79EF;&#x5F88;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x60F3;&#x518D;&#x8D9F;&#x6DF7;&#x6C34;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x522B;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x600E;&#x4E48;&#x5206;&#x53D1;&#x4ED6;&#x4EEC;&#x7684;&#x5B89;&#x88C5;&#x5305;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x60F3;&#x5907;&#x6848;&#xFF0C;&#x4E5F;&#x4E0D;&#x60F3;&#x4E3A;&#x4E86; APK &#x4E00;&#x76F4;&#x638F;&#x94B1;&#x4F9B;&#x7740;&#x4E00;&#x4E2A;&#x56FD;&#x5185;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x800C;&#x4E14; <strong>&#x8981;&#x60F3;&#x5728;&#x5FAE;&#x4FE1;&#x80FD;&#x8BBF;&#x95EE;&#x57DF;&#x540D;&#xFF0C;&#x8FD8;&#x5F97;&#x7ED9;&#x817E;&#x8BAF;&#x4EA4;&#x4FDD;&#x62A4;&#x8D39;&#xFF0C;&#x5426;&#x5219;&#x8BF4;&#x4F60;&#x4E0D;&#x5B89;&#x5168;</strong>&#xFF0C;&#x53BB;&#x54EA;&#x8BF4;&#x7406;&#x53BB;&#xFF1F;</p>
<p>&#x540E;&#x6765;&#x6211;&#x8FD8;&#x662F;&#x628A;&#x6587;&#x4EF6;&#x4F20;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7136;&#x540E;&#x7528; IP &#x505A;&#x4E86;&#x4E2A;&#x94FE;&#x63A5;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8111;&#x80FD;&#x4E0B;&#x8F7D;&#xFF0C;&#x4F46; <strong>&#x5FAE;&#x4FE1;&#x5185;&#x7F6E;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x662F;&#x4E0D;&#x884C;</strong>&#x3002;</p>
<p>&#x6211;&#x53EF;&#x4EE5;&#x6559;&#x6211;&#x5988;&#x600E;&#x4E48;&#x627E;&#x5230;&#x5FAE;&#x4FE1;&#x7684;&#x4E0B;&#x8F7D;&#x6587;&#x4EF6;&#x7136;&#x540E;&#x4FEE;&#x6539;&#x540E;&#x7F00;&#x540D;&#xFF0C;&#x4F46;&#x662F;&#x522B;&#x4EBA;&#x5462;&#xFF1F;&#x6211;&#x5988;&#x60F3;&#x628A;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x4ECB;&#x7ECD;&#x7ED9;&#x8EAB;&#x8FB9;&#x4EBA;&#x8BD5;&#x8BD5;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x8FDE;&#x6587;&#x4EF6;&#x7BA1;&#x7406;&#x90FD;&#x6CA1;&#x5F00;&#x8FC7;&#xFF0C;&#x603B;&#x4E0D;&#x80FD;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x6559;&#x4ED6;&#x4EEC;&#x5427;&#xFF1F;&#x6253;&#x5305;&#x66F4;&#x4E0D;&#x73B0;&#x5B9E;&#x4E86;&#xFF0C;<strong>&#x4EC0;&#x4E48;&#x662F; zip &#x4EC0;&#x4E48;&#x662F; tar &#x548C;&#x4F60;&#x4E03;&#x5927;&#x59D1;&#x516B;&#x5927;&#x59E8;&#x7684;&#x5DE5;&#x4F5C;&#x751F;&#x6D3B;&#x53EF;&#x80FD;&#x4E00;&#x70B9;&#x5173;&#x7CFB;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x5DE5;&#x4F5C;&#x90FD;&#x7528; Email</strong>&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x8981;&#x6070;&#x996D;&#xFF0C;&#x751F;&#x6D3B;&#x5DF2;&#x7ECF;&#x5F88;&#x8270;&#x96BE;&#x4E86;&#x3002;</p>
<p>&#x522B;&#x8BF4;&#x591A;&#x63D0;&#x4EA4;&#x51E0;&#x4E2A;&#x5546;&#x5E97;&#xFF0C;&#x6BCF;&#x6B21;&#x53D1;&#x65B0;&#x7248;&#x672C; GitHub Google Play &#x548C;&#x9177;&#x5B89;&#x4E09;&#x4E2A;&#x4E00;&#x8D77;&#x66F4;&#x65B0;&#x586B;&#x8868;&#x5C31;&#x5DF2;&#x7ECF;&#x82B1;&#x4E86;&#x597D;&#x591A;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x6BCF;&#x4E2A;&#x54C1;&#x724C;&#x7684;&#x624B;&#x673A;&#x90FD;&#x975E;&#x5F97;&#x505A;&#x4E00;&#x4E2A;&#x81EA;&#x5DF1;&#x7684;&#x5546;&#x5E97;&#xFF0C;&#x7528;&#x6237;&#x91CF;&#x4E0D;&#x5927;&#x8981;&#x6C42;&#x8FD8;&#x4E0D;&#x5C11;&#xFF0C;&#x8C01;&#x6709;&#x90A3;&#x597D;&#x5FC3;&#x4E00;&#x4E2A;&#x4E2A;&#x63D0;&#x4EA4;&#x53BB;&#x3002;</p>
<p>&#x8FD9;&#x80AF;&#x5B9A;&#x4E0D;&#x662F; Android &#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD5;&#x7ADF;&#x5982;&#x679C;&#x80FD;&#x7528; Google Play &#x95EE;&#x9898;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x4E86;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x80FD;&#x7528; Telegram &#x8FD9;&#x79CD;&#x804A;&#x5929;&#x8F6F;&#x4EF6;&#x4E5F;&#x884C;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x662F;&#x9E21;&#x7FA4;&#x91CC;&#x7684;&#x9E64;&#xFF0C;&#x6015;&#x4E0D;&#x662F;&#x4F1A;&#x88AB;&#x9E21;&#x7FA4;&#x8D77;&#x800C;&#x653B;&#x4E4B;&#x3002;&#x81F3;&#x4E8E; Firefox Send &#x4EC0;&#x4E48;&#x7684;&#x4F30;&#x8BA1;&#x5728;&#x56FD;&#x5185;&#x4E5F;&#x6CA1;&#x620F;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x6211;&#x751A;&#x81F3;&#x5F00;&#x59CB;&#x6000;&#x5FF5; QQ &#x4E86;&#xFF0C;&#x867D;&#x7136;&#x6D41;&#x6C13;&#xFF0C;&#x4F46;&#x662F;&#x8FD8;&#x662F;&#x80FD;&#x4F20;&#x6587;&#x4EF6;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x8BF4;&#x5230; QQ&#xFF0C;&#x6211;&#x53C8;&#x60F3;&#x8D77;&#x4E86;&#x51E0;&#x5E74;&#x524D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x76F8;&#x5F53;&#x4F69;&#x670D; QQ &#x7684;&#x5F00;&#x53D1;&#x8005;&#x8FD9;&#x79CD;&#x5728;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x91CC;&#x6253;&#x4E24;&#x4E2A;&#x5305;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5F53;&#x4F60;&#x7528; QQ &#x70B9;&#x5F00;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x94FE;&#x63A5;&#xFF0C;&#x7136;&#x540E;&#x70B9;&#x83DC;&#x5355;&#x9009;&#x201C;&#x7528; QQ &#x6D4F;&#x89C8;&#x5668;&#x6253;&#x5F00;&#x201D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0; QQ &#x5185;&#x5D4C;&#x4E86;&#x4E00;&#x4E2A; QQ &#x6D4F;&#x89C8;&#x5668; &#x2014;&#x2014; &#x602A;&#x4E0D;&#x5F97; QQ &#x6D4F;&#x89C8;&#x5668;&#x6709;&#x8138;&#x8BF4;&#x81EA;&#x5DF1;&#x88C5;&#x673A;&#x91CF;&#x7B2C;&#x4E00;&#xFF0C;&#x4EE5;&#x524D;&#x6211;&#x4EE5;&#x4E3A;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x8822;&#x778E;&#x4E86;&#x7528;&#x8FD9;&#x79CD;&#x5783;&#x573E;&#xFF0C;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x6211;&#x5931;&#x7B97;&#x4E86; &#x2014;&#x2014; &#x5F53;&#x7136;&#x6700;&#x9B54;&#x5E7B;&#x7684;&#x4E0D;&#x6B62;&#x4E8E;&#x6B64;&#xFF0C;&#x8FD9;&#x4E2A;&#x5185;&#x5D4C;&#x7684; QQ &#x6D4F;&#x89C8;&#x5668;&#x7248;&#x672C;&#x5F53;&#x7136;&#x662F;&#x5F88;&#x65E7;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x6253;&#x5F00;&#x4E86;&#x4E4B;&#x540E;&#x5B83;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#x8BA9;&#x4F60;&#x4E0B;&#x8F7D;&#x5B89;&#x88C5;&#x6700;&#x65B0;&#x7684; QQ &#x6D4F;&#x89C8;&#x5668; &#x2014;&#x2014; &#x4F60;&#x770B;&#x4E00;&#x4E2A;&#x4EBA;&#x80FD;&#x88C5;&#x4E24;&#x4E2A; QQ &#x6D4F;&#x89C8;&#x5668;&#xFF0C;<strong>&#x53D1;&#x660E;&#x8FD9;&#x4E2A;&#x6280;&#x672F;&#x7684;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x771F;&#x662F;&#x4E2A;&#x5C0F;&#x5929;&#x624D;</strong>&#xFF0C;&#x4ED6;&#x63A8;&#x52A8;&#x4E86;&#x624B;&#x673A;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E0A;&#x5347;&#xFF01;&#x8DDF;&#x4ED6;&#x6BD4;&#x8D77;&#x6765;&#x82F9;&#x679C;&#x7B97;&#x4E2A;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF01;</p>
<p>&#x73B0;&#x5728; QQ &#x7684;&#x4F53;&#x79EF;&#x8FD8;&#x662F;&#x5DE8;&#x65E0;&#x9738;&#xFF0C;&#x8FD9;&#x4E2A;&#x6309;&#x94AE;&#x4E5F;&#x4F9D;&#x7136;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x5927;&#x6982; QQ &#x6D4F;&#x89C8;&#x5668;&#x4ECD;&#x7136;&#x5D4C;&#x5728;&#x91CC;&#x9762;&#x5427;&#xFF0C;&#x800C;&#x4E14;&#x4F30;&#x8BA1;&#x7248;&#x672C;&#x4E00;&#x76F4;&#x90FD;&#x6CA1;&#x53D8;&#x8FC7;&#xFF0C;&#x6BD5;&#x7ADF;&#x80FD;&#x53D8;&#x6210;&#x4FE9;&#x9E21;&#x86CB;&#x7684;&#x53CC;&#x9EC4;&#x86CB;&#x5927;&#x5BB6;&#x90FD;&#x559C;&#x6B22;&#x3002;&#x795D; QQ &#x672A;&#x6765;&#x80FD;&#x628A;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x817E;&#x8BAF;&#x7684;&#x5E94;&#x7528;&#x90FD;&#x5D4C;&#x8FDB;&#x53BB;&#xFF0C;&#x65E9;&#x65E5;&#x7A81;&#x7834; 1 GB &#x5927;&#x5173;&#x3002;</p>
<p><em>AlynxZhou</em></p>
<p><strong>A Coder &amp; Dreamer</strong></p>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/Android/" rel="tag"><i class="fas fa-tag"></i>Android</a><a class="post-tag button" href="/tags/%E6%84%A4%E6%80%92/" rel="tag"><i class="fas fa-tag"></i>愤怒</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
      <a href="/posts/Android-Video-Wallpaper-Implementation/" rel="next" title="如何编写 Android 视频壁纸"><i class="fas fa-angle-left"></i><span class="nav-title">如何编写 Android 视频壁纸</span></a>
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/posts/GNOME-Develop/" rel="prev" title="GNOME 的修改开发与测试"><span class="nav-title">GNOME 的修改开发与测试</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
  

<div class="reward" id="reward">
  <p>既然看了喵写的文章，不打算投喂一下再走吗？哼！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>打赏</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechatpay">
      <img id="wechatpay-qr" src="/images/WeChatPay.png" alt="微信支付"/>
      <span>微信支付</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay-qr" src="/images/AliPay.png" alt="支付宝"/>
      <span>支付宝</span>
    </div>
    
    
  </div>
</div>



  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "AlynxZhou",
      "repo": "stackharbor",
      "clientID": "",
      "clientSecret": "6db7dd16477eadc1e96160a23c6ba4cf687dcecf",
      "no_comment": "这个页面还没有评论，现在就去评论吧！",
      "go_to_comment": "去评论",
      "issue_title": "在中国 Android 环境下传个 APK 有多难",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="搜索" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/Future_Gazer_small.png" alt="Alynx Zhou">
  
  <h1 class="author-name">Alynx Zhou</h1>
  <h2 class="author-description">望むものなら残さず<br>輝ける自分らしさで</h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">归档</div>
      <div><a href="/archives/">57</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">分类</div>
      <div><a href="/categories/">38</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">标签</div>
      <div><a href="/tags/">60</a></div>
    </div>
    
    
    
    
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>社交链接</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:alynx.zhou@gmail.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/AlynxZhou/" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-telegram-plane"></i><a href="https://t.me/AlynxZhou/" target="_blank">Telegram</a></li>
        
        <li><i class="fas fa-video"></i><a href="https://space.bilibili.com/10034969/" target="_blank">Bilibili</a></li>
        
        <li><i class="fab fa-weibo"></i><a href="https://weibo.com/u/5287501461" target="_blank">Weibo</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>友情链接</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://lrscy.github.io/" target="_blank">Meow's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://lgiki.cc/" target="_blank">LGiki's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://hackghost.com/" target="_blank">HackGhost's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://chenxy.moe/" target="_blank">Art_Chen's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jm33.me/" target="_blank">Jm33_m0's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://farseerfc.me/" target="_blank">Farseerfc 的小窝</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://huaji.store/" target="_blank">滑稽仓库</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jitui.moe/" target="_blank">鸡腿工坊</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sh.yorushika.co/" target="_blank">Yorushika Shi's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sqyon.com/" target="_blank">Sqyon's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://blog.yoitsu.moe/" target="_blank">约伊兹的萌狼乡手札</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #33363b;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="回到顶部"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>Alynx Zhou</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-nd/4.0/" target="_blank">BY-NC-ND 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="站点点击量" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="站点用户数" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="页面点击量" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          托管于<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">GitHub Pages</a>
          
        </div>
        <div class="powered-by">
          由 <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a> 强力驱动<i class="fab fa-node-js"></i>主题 <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
<!-- Page built by Hikaru v1.14.2 at 2019-05-10 周五 22:13:18 CST. -->
