<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#33363b">
    <meta name="msapplication-TileColor" content="#33363b">
    
    
    <meta name="google-site-verification" content="VmX1m6eF3rZhAf1iR5DhqrbiF_5se-s902W14pPryQk">
    
    
    <meta name="keywords" content="Code, Music, Life, Linux, Arch Linux, Gentoo, JavaScript, ARIA, Hikaru">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#33363b">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="喵's StackHarbor" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>StackHarbor 的 2016 尾记 | 喵's StackHarbor - Whisper to the World</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="zh_CN"  data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #33363b;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">喵's StackHarbor</a></h1>
        <h2 class="subtitle">Whisper to the World</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="切换导航栏"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">首页</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">归档</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">分类</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">标签</span></a></li>
        
        <li role="menuitem"><a href="/Undefined-Shell-Works/"><i class="fas fa-terminal"></i><span class="menu-text">Undefined Shell Works!</span></a></li>
        
        <li role="menuitem"><a href="/blogroll/"><i class="fas fa-link"></i><span class="menu-text">友情链接</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">关于</span></a></li>
        
      </ul>
    </nav>
  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card animate" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://sh.alynx.xyz/posts/2016-Tail/">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="Alynx Zhou">
        <meta itemprop="description" content="Everything that lives is designed to end.">
        <meta itemprop="image" content="/images/Future_Gazer_small.png">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="喵's StackHarbor">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">StackHarbor 的 2016 尾记</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2016-12-31T09:39:02.000Z">2016-12-31 周六 17:39:02 CST</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/" itemprop="url" rel="index"><span itemprop="name">随记</span></a></span><i class="fas fa-angle-right"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/%E7%94%9F%E6%B4%BB/" itemprop="url" rel="index"><span itemprop="name">生活</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <p><img src="/posts/2016-Tail/2016-tail_fushishan.jpg" alt="2016-tail_fushishan.jpg"></p>
<blockquote class="centerquote">&#x5927;&#x8C61;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x9057;&#x5FD8;&#x3002;</blockquote>

<p>&#x8F6C;&#x773C;&#x95F4;&#x65F6;&#x5149;&#x98DE;&#x901D;&#xFF0C;&#x7AD9;&#x5728;&#x4E86;2016&#x7684;&#x5C3E;&#x5DF4;&#x4E0A;&#xFF08;2016&#xFF1A;&#x597D;&#x75BC;&#xFF01;&#xFF09;&#xFF0C;&#x4ED4;&#x7EC6;&#x60F3;&#x60F3;&#x4F3C;&#x4E4E;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x8BF4;&#x7684;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x8003;&#x5B8C;&#x4E86;&#x9AD8;&#x8003;&#xFF0C;&#x4E0A;&#x4E86;&#x5927;&#x5B66;&#xFF0C;&#x5199;&#x4E86;&#x4E00;&#x5806;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6BD4;&#x5982;<a href="https://github.com/AlynxZhou/namefight" target="_blank">&#x8FD9;&#x4E2A;</a>&#xFF0C;&#x5634;&#x4E0A;&#x5929;&#x5929;&#x8BF4;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8FD8;&#x662F;&#x6709;&#x4E0D;&#x5C11;&#x6CA1;&#x505A;&#xFF0C;&#x6BD4;&#x5982;&#x6539;&#x4E00;&#x6539;Emacs&#x914D;&#x7F6E;&#xFF08;&#x8FD9;&#x79CD;flag&#x6210;&#x672C;&#x592A;&#x9AD8;&#x4E86;&#x7ACB;&#x4E0D;&#x5F97;&#xFF09;&#xFF0C;&#x8FD8;&#x6709;&#x6839;&#x672C;&#x5C31;&#x7ACB;&#x4E0D;&#x4E86;&#x7684;flag&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x8BF4;&#x7A7F;&#x4E86;&#x4E5F;&#x8FD8;&#x662F;&#x81EA;&#x5DF1;&#x592A;&#x5F31;&#x4E86;&#x5427;&#x3002;</p>
<a id="more"></a>

<p><strong>&#x672C;&#x6587;&#x642D;&#x914D;&#x97F3;&#x4E50;&#x98DF;&#x7528;&#x5E94;&#x8BE5;&#x66F4;&#x4F73;&#xFF0C;&#x4E3A;&#x4E86;&#x7167;&#x987E;&#x6D41;&#x91CF;&#x515A;&#x548C;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x81EA;&#x52A8;&#x64AD;&#x653E;&#xFF0C;&#x8BF7;&#x624B;&#x52A8;&#x64AD;&#x653E;&#x540E;&#x7EE7;&#x7EED;&#xFF01;</strong>&#x5982;&#x679C;&#x4F60;&#x4F34;&#x968F;&#x7740;&#x97F3;&#x4E50;&#x770B;&#x5B8C;&#x4E86;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x9884;&#x671F;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x53EA;&#x80FD;&#x544A;&#x8BC9;&#x4F60;&#xFF1A;<strong>&#x6700;&#x7EC8;&#x89E3;&#x91CA;&#x6743;&#x5F52;&#x672C;&#x4EBA;&#x6240;&#x6709;&#xFF01;</strong></p>
<iframe frameborder="no" border="0" marginwidth="0" marginheight="0" width="330" height="86" src="//music.163.com/outchain/player?type=2&amp;id=306719&amp;auto=0&amp;height=66"></iframe>

<hr>
<p>&#x6709;&#x4E9B;&#x4E8B;&#xFF0C;&#x6BCF;&#x5929;&#x6302;&#x5728;&#x5634;&#x8FB9;&#x4E5F;&#x8FD8;&#x662F;&#x505A;&#x4E0D;&#x5230;&#xFF0C;&#x6BD4;&#x5982;&#x8131;&#x5355;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5E0C;&#x671B;&#x5728;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x91CC;&#x6536;&#x83B7;&#x611F;&#x60C5;&#xFF0C;&#x4E0D;&#x8981;&#x518D;&#x8BA9;&#x6211;&#x5B64;&#x72EC;&#x5730;&#x7B49;&#x4E0B;&#x53BB;&#x4E86;&#xFF0C;&#x53CD;&#x6B63;&#x90FD;&#x77E5;&#x9053;&#x6211;&#x81EA;&#x5DF1;&#x6CA1;&#x529E;&#x6CD5;&#x51FA;&#x624B;&#xFF0C;&#x8FD9;&#x4E2A;&#x969C;&#x788D;&#x8FD8;&#x662F;&#x8981;&#x9760;&#x522B;&#x4EBA;&#x5E2E;&#x6211;&#x514B;&#x670D;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x8BDD;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x5FC3;&#x91CC;&#x91CD;&#x590D;&#x4E86;&#x65E0;&#x6570;&#x904D;&#xFF0C;&#x4E5F;&#x6CA1;&#x529E;&#x6CD5;&#x8BF4;&#x51FA;&#x53E3;&#x3002;</p>
<p>&#x6709;&#x4E9B;&#x4EBA;&#xFF0C;&#x5373;&#x4F7F;&#x79BB;&#x7684;&#x518D;&#x8FDC;&#xFF0C;&#x518D;&#x4E45;&#x6CA1;&#x6709;&#x8054;&#x7CFB;&#xFF0C;&#x597D;&#x50CF;&#x5DF2;&#x7ECF;&#x5B8C;&#x5168;&#x7684;&#x8131;&#x79BB;&#x4E86;&#x751F;&#x6D3B;&#xFF0C;&#x4E5F;&#x80FD;&#x5728;&#x4E0D;&#x7ECF;&#x610F;&#x95F4;&#x89E6;&#x52A8;&#x4F60;&#x3002;</p>
<p>&#x5927;&#x8C61;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x9057;&#x5FD8;&#x3002;</p>
<p>&#x7ED9;&#x8FD9;&#x4E00;&#x5E74;&#x5206;&#x4E00;&#x4E2A;&#x8BCD;&#x8BED;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x662F;&#x201C;&#x6539;&#x53D8;&#x201D;&#x3002;</p>
<p>&#x6210;&#x957F;&#x662F;&#x4E00;&#x4E2A;&#x81EA;&#x7136;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x6210;&#x719F;&#x5374;&#x5E38;&#x5E38;&#x610F;&#x5473;&#x7740;&#x4E0E;&#x81EA;&#x7136;&#x76F8;&#x53CD;&#xFF0C;nature&#x5982;&#x679C;&#x6392;&#x5E8F;&#x7684;&#x8BDD;&#xFF0C;&#x80AF;&#x5B9A;&#x8981;&#x6392;&#x5728;mature&#x7684;&#x540E;&#x9762;&#x3002;</p>
<p>&#x4E0D;&#x51FA;&#x610F;&#x6599;&#x5730;&#x5199;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5E26;GUI&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x867D;&#x7136;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x610F;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x4EC5;&#x4EC5;&#x5728;&#x4ECA;&#x5E74;&#x7ED3;&#x675F;&#x524D;&#x51E0;&#x5929;&#x624D;&#x6210;&#x578B;&#xFF0C;&#x4F46;&#x6211;&#x8FD8;&#x662F;&#x613F;&#x610F;&#x628A;&#x5B83;&#x5F53;&#x4F5C;&#x81EA;&#x5DF1;&#x4ECA;&#x5E74;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#x5427;&#xFF0C;&#x6CA1;&#x6709;&#x5199;&#x8FC7;&#x7684;&#x4EBA;&#x4E0D;&#x4F1A;&#x61C2;&#xFF0C;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x6478;&#x7D22;&#x5199;&#x4EE3;&#x7801;&#x7ECF;&#x5386;&#x7684;&#x4EBA;&#x4E5F;&#x4E0D;&#x4F1A;&#x61C2;&#x3002;</p>
<p>&#x90FD;&#x5199;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x7A0B;&#x5E8F;&#x4E86;&#xFF0C;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x73A9;&#x5177;&#x503C;&#x5F97;&#x8FD9;&#x4E48;&#x9AD8;&#x5174;&#x561B;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x503C;&#x5F97;&#x3002;</p>
<p>&#x5047;&#x5982;&#x4F60;&#x5728;&#x6700;&#x5FD9;&#x7684;&#x65F6;&#x95F4;&#x91CC;&#x4F9D;&#x7136;&#x4FDD;&#x6301;&#x7740;&#x5BF9;&#x7F16;&#x7A0B;&#x7684;&#x70ED;&#x7231;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x80FD;&#x7406;&#x89E3;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4EBA;&#x5728;&#x4E0A;&#x5B66;&#x653E;&#x5B66;&#x7684;&#x8DEF;&#x4E0A;&#x5728;&#x53E3;&#x888B;&#x91CC;&#x88C5;&#x7740;&#x5199;&#x6EE1;&#x4EE3;&#x7801;&#x7684;&#x672C;&#x5B50;&#xFF0C;&#x6CA1;&#x6709;&#x952E;&#x76D8;&#x62FF;&#x624B;&#x673A;ssh&#x4E5F;&#x8981;&#x628A;&#x7A0B;&#x5E8F;&#x5199;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x7684;&#x7406;&#x89E3;&#x66F4;&#x591A;&#x4ED6;&#x8FD8;&#x4E0D;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x5DE5;&#x5177;&#x5C31;&#x662F;&#x4ED6;&#x7684;&#x8FFD;&#x6C42;&#xFF0C;GUI&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x8FFD;&#x6C42;&#x8DEF;&#x4E0A;&#x7684;&#x91CC;&#x7A0B;&#x7891;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;GUI&#x7F16;&#x7A0B;&#x4E0D;&#x662F;&#x50CF;&#x5927;&#x90E8;&#x5206;&#x4E00;&#x6837;&#xFF0C;&#x60F3;&#x5F53;&#x7136;&#x5730;&#x4F34;&#x968F;&#x7740;&#x7A0B;&#x5E8F;&#x51FA;&#x73B0;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x73A9;&#x5177;&#x79EF;&#x6728;&#x4E00;&#x6837;&#x5728;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x6307;&#x5BFC;&#x4E0B;&#x62FC;&#x63A5;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x5728;&#x5199;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E4B;&#x524D;&#xFF0C;&#x8D77;&#x7801;&#x8981;&#x505A;&#x7684;&#x51C6;&#x5907;&#x662F;&#x5728;CLI&#x4E0B;&#x7406;&#x89E3;&#x4E00;&#x4E2A;&#x8BED;&#x8A00;&#xFF0C;&#x7136;&#x540E;&#x628A;GUI&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x8BA9;&#x7A0B;&#x5E8F;&#x80FD;&#x8DDF;&#x5927;&#x90E8;&#x5206;&#x4EBA;&#x66F4;&#x597D;&#x4EA4;&#x6D41;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x626F;&#x8FDC;&#x4E86;&#xFF0C;&#x603B;&#x4E4B;&#x6211;&#x5F88;&#x9AD8;&#x5174;&#x81EA;&#x5DF1;&#x6478;&#x7D22;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x9886;&#x57DF;&#xFF0C;&#x5728;&#x4EE5;&#x524D;&#x6839;&#x672C;&#x4E0D;&#x6562;&#x60F3;&#x7684;&#x3002;&#x7F16;&#x7801;&#x4E3A;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x70ED;&#x7231;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x53D6;&#x60A6;&#x81EA;&#x5DF1;&#xFF0C;&#x5728;&#x4E00;&#x884C;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x91CC;&#x627E;&#x5230;&#x95EE;&#x9898;&#x6240;&#x5728;&#x5E76;&#x53BB;&#x89E3;&#x51B3;&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x6109;&#x60A6;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x81EA;&#x7136;&#x7684;&#x53CD;&#x5E94;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x522B;&#x7684;&#x76EE;&#x7684;&#x53BB;&#x9A71;&#x4F7F;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x9AD8;&#x5174;&#x7684;&#x662F;&#x63D0;&#x4E86;<a href="https://github.com/iissnan/hexo-theme-next/pull/1327" target="_blank">&#x7B2C;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;PR</a>&#xFF0C;&#x7ED9;NexT&#x4E3B;&#x9898;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x88AB;&#x5408;&#x5E76;&#x8FDB;&#x53BB;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#x4E3B;&#x8981;&#x7684;&#x610F;&#x4E49;&#x662F;&#x4E3A;&#x4E86;&#x6DFB;&#x52A0;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x6211;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x5927;&#x6982;&#x7406;&#x6E05;&#x4E86;NexT&#x6240;&#x7528;&#x8BED;&#x8A00;&#x7684;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#x548C;&#x5B9E;&#x73B0;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5728;&#x4E4B;&#x524D;&#x5E76;&#x6CA1;&#x6709;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x8FC7;yaml&#x548C;javascript&#x3001;swig&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x628A;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x52A0;&#x8FDB;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x7ED9;&#x5B83;&#x6DFB;&#x52A0;&#x4E86;&#x5F00;&#x5173;&#xFF0C;&#x867D;&#x7136;&#x6700;&#x540E;&#x5B9E;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x7406;&#x6E05;&#x95EE;&#x9898;&#x4E5F;&#x662F;&#x6211;&#x60F3;&#x8981;&#x7684;&#x80FD;&#x529B;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x5509;&#xFF0C;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x5E9F;&#x8BDD;&#xFF0C;&#x53C8;&#x6CA1;&#x6709;&#x4EBA;&#x7ED9;&#x6211;&#x7A3F;&#x8D39;&#xFF0C;&#x8981;&#x4E0D;&#x8FD8;&#x662F;&#x591A;&#x5199;&#x70B9;&#x6280;&#x672F;&#x6027;&#x6587;&#x7AE0;&#x5427;&#xFF0C;&#x8FD8;&#x80FD;&#x63D0;&#x9AD8;&#x70B9;&#x903C;&#x683C;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x53EA;&#x7339;&#xFF0C;&#x672C;&#x7339;&#x8FD8;&#x662F;&#x8981;&#x591A;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x90A3;&#x4E9B;&#x5728;&#x67D0;&#x4E2A;&#x665A;&#x4E0A;&#x5145;&#x6EE1;&#x706F;&#x5149;&#x7684;&#x5C4B;&#x5B50;&#x91CC;&#x5750;&#x5728;&#x7A97;&#x8FB9;&#x60F3;&#x5230;&#x7684;&#x8BDD;&#x90FD;&#x53BB;&#x54EA;&#x91CC;&#x4E86;&#x5462;&#xFF1F;&#x6709;&#x4E9B;&#x81EA;&#x5DF1;&#x4E5F;&#x89C9;&#x5F97;&#x6CA1;&#x5934;&#x6CA1;&#x8111;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x5B9E;&#x5728;&#x662F;&#x672C;&#x7339;&#x611A;&#x949D;&#x9A7E;&#x9A6D;&#x4E0D;&#x4E86;&#x7684;&#xFF0C;&#x7D22;&#x6027;&#x653E;&#x51FA;&#x53BB;&#x73A9;&#x597D;&#x4E86;&#xFF0C;&#x81F3;&#x4E8E;&#x5269;&#x4E0B;&#x7075;&#x5149;&#x4E00;&#x73B0;&#x62CD;&#x8111;&#x888B;&#x80FD;&#x5199;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x8D34;&#x4E0A;&#x6765;&#x4E86;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#x770B;&#xFF0C;&#x770B;&#x4E86;&#x4E5F;&#x6CA1;&#x6709;&#x4EBA;&#x8BF4;&#x597D;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x597D;&#x4E5F;&#x4E0D;&#x4F1A;&#x8BF4;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x8981;&#x518D;&#x6253;&#x4E00;&#x56DE;&#x8138;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x770B;&#x89C1;&#x4E0A;&#x9762;&#x90A3;&#x53E5;&#x611F;&#x5174;&#x8DA3;&#x4E86;&#xFF0C;&#x60F3;&#x8BF4;&#x597D;&#x4E86;&#x60F3;&#x7559;&#x8A00;&#x4E86;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x4E0D;&#x9519;&#xFF0C;&#x63A8;&#x8350;&#x4F60;&#x770B;&#x7684;&#x662F;<strong><a href="/04/12/Corner-Tree/">&#x8FD9;&#x7BC7;</a></strong>&#xFF0C;&#x65E0;&#x6240;&#x8C13;&#xFF0C;&#x6211;&#x53C8;&#x4E0D;&#x662F;&#x8001;&#x7F57;&#x5356;&#x60C5;&#x6000;&#xFF0C;&#x80FD;&#x6253;&#x8138;&#x5C31;&#x81EA;&#x89C9;&#x6253;&#x54AF;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x8981;&#x662F;&#x5410;&#x69FD;&#x6216;&#x8005;&#x704C;&#x6C34;&#x5C31;&#x7B97;&#x4E86;&#x3002;</p>
<p>&#x5C55;&#x671B;2017&#xFF0C;&#x8FD8;&#x80FD;&#x671F;&#x671B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x53CD;&#x6B63;&#x90FD;&#x662F;&#x9760;&#x81EA;&#x5DF1;&#x4ED8;&#x51FA;&#x83B7;&#x5F97;&#x7684;&#xFF0C;&#x542C;&#x82F1;&#x8BED;&#x4F5C;&#x4E1A;&#x5230;&#x5410;&#x8840;&#xFF0C;&#x7EC8;&#x4E8E;&#x628A;&#x81EA;&#x5DF1;&#x542C;&#x529B;&#x63D0;&#x9AD8;&#x4E00;&#x70B9;&#x4E86;&#xFF0C;&#x5199;&#x4E86;&#x597D;&#x591A;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x7EC8;&#x4E8E;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x80FD;&#x529B;&#x53C8;&#x4E0A;&#x5347;&#x4E00;&#x7EA7;&#x4E86;&#xFF0C;&#x5410;&#x69FD;&#x662F;&#x8981;&#x5410;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5149;&#x5410;&#x69FD;&#x4E0D;&#x5E72;&#x6D3B;&#x53EF;&#x4E0D;&#x600E;&#x4E48;&#x6837;&#xFF0C;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x5C31;&#x66F4;&#x4E0D;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x70ED;&#x7231;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x62FC;&#x5C3D;&#x5168;&#x529B;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x662F;&#x4E0D;&#x591F;&#x70ED;&#x7231;&#xFF0C;&#x4E22;&#x6389;&#x4E5F;&#x4E0D;&#x53EF;&#x60DC;&#xFF0C;&#x9001;&#x7ED9;&#x6709;&#x9009;&#x62E9;&#x56F0;&#x96BE;&#x548C;&#x7591;&#x4F3C;&#x5FC3;&#x7406;&#x969C;&#x788D;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x5E86;&#x5E78;&#x8FD9;&#x534A;&#x5E74;&#x8BA4;&#x8BC6;&#x4E86;&#x597D;&#x591A;&#x5BF9;&#x6211;&#x5F88;&#x597D;&#x7684;&#x4EBA;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x76F4;&#x4E00;&#x8D77;&#x4E0A;&#x8BFE;&#x7684;&#x6218;&#x795E;&#xFF0C;&#x81EA;&#x5DF1;&#x80AF;&#x5B9A;&#x662F;&#x6CA1;&#x6709;&#x770B;&#x4E0A;&#x53BB;&#x90A3;&#x4E48;&#x5F3A;&#xFF0C;&#x751A;&#x81F3;&#x5F88;&#x8106;&#x5F31;&#xFF0C;&#x603B;&#x662F;&#x72AF;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x6BDB;&#x75C5;&#xFF0C;&#x4E5F;&#x8BB8;&#x6CA1;&#x6709;&#x4EBA;&#x966A;&#x7684;&#x8BDD;&#x6211;&#x81EA;&#x5DF1;&#x662F;&#x6D3B;&#x4E0D;&#x4E0B;&#x53BB;&#x7684;&#x3002;&#x518D;&#x6BD4;&#x5982;&#x5BF9;&#x6211;&#x7279;&#x522B;&#x597D;&#x7684;&#x66F9;&#x5B66;&#x59D0;&#x548C;&#x68EE;&#x795E;&#xFF0C;&#x4EE5;&#x53CA;&#x864E;&#x54E5;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x8BF4;&#x4EC0;&#x4E48;&#x6765;&#x8C22;&#x8C22;&#x4F60;&#x4EEC;&#xFF0C;&#x8FD8;&#x8BA4;&#x8BC6;&#x4E86;&#x8BB8;&#x591A;&#x5173;&#x7CFB;&#x4E0D;&#x9519;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x6BD4;&#x5982;&#x67D0;&#x718A;&#x548C;&#x7537;&#x795E;&#xFF0C;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#x4F60;&#x4EEC;&#x90FD;&#x61C2;&#x5566;&#xFF0C;&#x53CD;&#x6B63;&#x6211;&#x662F;&#x8822;&#x55B5;&#xFF0C;&#x7339;&#x4E0D;&#x7339;&#x7684;&#x5148;&#x4E00;&#x8FB9;&#x5B50;&#x53BB;&#x5427;&#x2026;&#x2026;&#x4E0D;&#x884C;&#x6211;&#x8FD9;&#x91CC;&#x8981;&#x8BF4;&#x7684;&#x8FD8;&#x6709;&#x4E00;&#x7FA4;dalao&#x6BD4;&#x5982;&#x8303;&#x795E;&#x3001;&#x535A;&#x795E;&#x548C;&#x67D0;HHKB&#x5927;&#x4F6C;&#xFF0C;&#x672C;&#x7339;&#x8FD8;&#x662F;&#x8981;&#x7ED9;&#x5404;&#x4F4D;dalao&#x9012;&#x9012;&#x7339;&#xFF0C;&#x80FD;&#x5F97;&#x5230;dalao&#x5938;&#x5956;&#x80AF;&#x5B9A;&#x662F;&#x672C;&#x7339;&#x5F88;&#x5F00;&#x5FC3;&#x7684;&#x4E8B;&#x60C5;&#x5566;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#x5462;&#xFF0C;&#x5982;&#x679C;2017&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x671F;&#x5F85;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x8BDD;&#x2026;&#x2026;&#x5509;&#x592A;&#x7F9E;&#x803B;&#x4E86;&#x4E0D;&#x80FD;&#x8BF4;&#x3002;</p>
<p>&#x7B97;&#x4E86;&#x592A;&#x7F9E;&#x803B;&#x4E86;&#x8FD8;&#x662F;&#x8981;&#x8BF4;&#x7684;&#xFF0C;&#x85CF;&#x7684;&#x592A;&#x6DF1;&#x7EF4;&#x6301;&#x4E24;&#x9762;&#x4EBA;&#x683C;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x7D2F;&#x4E86;&#x672C;&#x7339;&#x53D7;&#x4E0D;&#x4E86;&#x5566;&#x3002;<del>&#x6211;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x591A;&#x5E74;&#x6CA1;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x9690;S&#xFF0C;&#x8FD8;&#x662F;&#x60F3;&#x8981;<strong>&#x4E00;&#x4E2A;&#x5408;&#x62CD;&#x7684;&#x6296;M</strong>&#x5566;&#xFF01;&#xFF08;&#x5FC5;&#x987B;&#x662F;&#x59B9;&#x5B50;&#xFF01;&#x80FD;&#x62FF;&#x7EF3;&#x5B50;&#x6346;&#x8D77;&#x6765;&#x73A9;&#x7684;&#xFF01;&#xFF09;&#xFF08;&#x4E0A;&#x9762;&#x90A3;&#x53E5;&#x8BDD;&#x4E0D;&#x8981;&#x8BEF;&#x89E3;&#xFF0C;&#x6211;&#x5BF9;LGBT&#x7FA4;&#x4F53;&#x6CA1;&#x6709;&#x6B67;&#x89C6;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x65E0;&#x7F18;&#x65E0;&#x6545;&#x7684;&#x7ED9;&#x6027;&#x53D6;&#x5411;&#x6B63;&#x5E38;&#x7684;&#x4EBA;&#x6263;&#x4E2A;&#x4E0D;&#x6B63;&#x5E38;&#x7684;&#x5E3D;&#x5B50;&#xFF0C;&#x786C;&#x8981;&#x628A;&#x4EBA;&#x63B0;&#x5F2F;&#x53EF;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x4E86;&#xFF0C;&#x5E73;&#x7B49;&#x53EF;&#x4E0D;&#x662F;&#x8BF4;Gay&#x5C31;&#x80FD;&#x968F;&#x4FBF;&#x8C03;&#x620F;&#x76F4;&#x7537;&#x7684;&#x597D;&#x5417;&#x2026;&#x2026;&#xFF09;</del></p>
<p>&#x5FC3;&#x7406;&#x5E74;&#x9F84;&#x5927;&#x4E86;&#xFF1F;&#x53CD;&#x6B63;&#x73B0;&#x5728;&#x662F;&#x6CA1;&#x6709;&#x5F53;&#x521D;&#x6298;&#x817E;&#x5237;&#x673A;&#x7684;&#x7CBE;&#x529B;&#x4E86;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x987A;&#x987A;&#x5229;&#x5229;&#x7684;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x5B9E;&#x5728;&#x4E0D;&#x884C;&#x5C31;&#x5F97;&#x964D;&#x4F4E;&#x70B9;&#x81EA;&#x5DF1;&#x7684;&#x671F;&#x5F85;&#xFF0C;&#x6EE1;&#x8DB3;&#x611F;&#x662F;&#x4E2A;&#x597D;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x65B0;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x552F;&#x613F;&#x518D;&#x65E0;&#x6CE2;&#x6F9C;&#x3002;</p>
<p><em>AlynxZhou</em></p>
<p><strong>A Coder &amp; Dreamer</strong></p>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/%E9%9A%8F%E8%AE%B0/" rel="tag"><i class="fas fa-tag"></i>随记</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
      <a href="/posts/Some-Thoughts/" rel="next" title="一些想法"><i class="fas fa-angle-left"></i><span class="nav-title">一些想法</span></a>
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/posts/First-Snow/" rel="prev" title="初雪"><span class="nav-title">初雪</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
  

<div class="reward" id="reward">
  <p>既然看了喵写的文章，不打算投喂一下再走吗？哼！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>打赏</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechatpay">
      <img id="wechatpay-qr" src="/images/WeChatPay.png" alt="微信支付"/>
      <span>微信支付</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay-qr" src="/images/AliPay.png" alt="支付宝"/>
      <span>支付宝</span>
    </div>
    
    
  </div>
</div>



  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "AlynxZhou",
      "repo": "stackharbor.alynx.xyz",
      "clientID": "",
      "clientSecret": "6db7dd16477eadc1e96160a23c6ba4cf687dcecf",
      "no_comment": "这个页面还没有评论，现在就去评论吧！",
      "go_to_comment": "去评论",
      "issue_title": "StackHarbor 的 2016 尾记",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="搜索" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/Future_Gazer_small.png" alt="Alynx Zhou">
  
  <h1 class="author-name">Alynx Zhou</h1>
  <h2 class="author-description">Everything that lives is designed to end.</h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">归档</div>
      <div><a href="/archives/">52</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">分类</div>
      <div><a href="/categories/">39</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">标签</div>
      <div><a href="/tags/">61</a></div>
    </div>
    
    
    
    
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>社交链接</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:alynx.zhou@gmail.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/AlynxZhou/" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-telegram-plane"></i><a href="https://t.me/AlynxZhou/" target="_blank">Telegram</a></li>
        
        <li><i class="fas fa-video"></i><a href="https://space.bilibili.com/10034969/" target="_blank">Bilibili</a></li>
        
        <li><i class="fab fa-weibo"></i><a href="https://weibo.com/u/5287501461" target="_blank">Weibo</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>友情链接</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://lrscy.github.io/" target="_blank">Meow's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://lgiki.cc/" target="_blank">LGiki's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://hackghost.com/" target="_blank">HackGhost's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://chenxy.moe/" target="_blank">Art_Chen's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jm33.me/" target="_blank">Jm33_m0's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://farseerfc.me/" target="_blank">Farseerfc 的小窝</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://huaji.store/" target="_blank">滑稽仓库</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jitui.moe/" target="_blank">鸡腿工坊</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sh.yorushika.live/" target="_blank">Yorushika Shi's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sqyon.com/" target="_blank">Sqyon's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://blog.yoitsu.moe/" target="_blank">约伊兹的萌狼乡手札</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #33363b;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="回到顶部"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>Alynx Zhou</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-nd/4.0/" target="_blank">BY-NC-ND 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="站点点击量" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="站点用户数" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="页面点击量" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          托管于<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">GitHub Pages</a>
          
        </div>
        <div class="powered-by">
          由 <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a> 强力驱动<i class="fab fa-node-js"></i>主题 <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
<!-- Page built by Hikaru v1.13.7 at 2019-02-24 周日 19:12:12 CST. -->
