<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#33363b">
    <meta name="msapplication-TileColor" content="#33363b">
    
    
    <meta name="google-site-verification" content="VmX1m6eF3rZhAf1iR5DhqrbiF_5se-s902W14pPryQk">
    
    
    <meta name="keywords" content="Code, Music, Life, Linux, Arch Linux, Gentoo, JavaScript, ARIA, Hikaru">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#33363b">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="喵's StackHarbor" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>碎碎念 | 喵's StackHarbor - Whisper to the World</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="zh_CN"  data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #33363b;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">喵's StackHarbor</a></h1>
        <h2 class="subtitle">Whisper to the World</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="切换导航栏"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">首页</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">归档</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">分类</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">标签</span></a></li>
        
        <li role="menuitem"><a href="/Undefined-Shell-Works/"><i class="fas fa-terminal"></i><span class="menu-text">Undefined Shell Works!</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">关于</span></a></li>
        
      </ul>
    </nav>
  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card animate" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://sh.alynx.xyz/posts/Some-Words/">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="AlynxZhou">
        <meta itemprop="description" content="Everything that lives is designed to end.">
        <meta itemprop="image" content="/images/saber.png">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="喵's StackHarbor">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">碎碎念</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2017-02-01T13:47:07.000Z">2017-02-01 周三 21:47:07 CST</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/" itemprop="url" rel="index"><span itemprop="name">随记</span></a></span><i class="fas fa-angle-right"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/%E7%94%9F%E6%B4%BB/" itemprop="url" rel="index"><span itemprop="name">生活</span></a></span><i class="fas fa-angle-right"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/%E7%94%9F%E6%B4%BB/%E6%8A%98%E8%85%BE/" itemprop="url" rel="index"><span itemprop="name">折腾</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <blockquote class="centerquote">&#x6211;&#x8FD8;&#x662F;&#x4F1A;&#x56DE;&#x5934;&#x3001;&#x6CE8;&#x89C6;&#xFF0C;&#x8857;&#x4E0A;&#x6BCF;&#x4E00;&#x4E2A;&#x50CF;&#x66FE;&#x7ECF;&#x7684;&#x5979;&#x7684;&#x4EBA;&#xFF0C;&#x4F46;&#x5373;&#x4F7F;&#x6211;&#x6D3B;&#x5728;&#x8FC7;&#x53BB;&#xFF0C;&#x5FC3;&#x91CC;&#x4E5F;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x5979;&#x7684;&#x6253;&#x626E;&#x65E9;&#x5DF2;&#x4E0D;&#x662F;&#x90A3;&#x65F6;&#x5019;&#x539F;&#x6765;&#x7684;&#x6837;&#x5B50;&#x4E86;&#x3002;</blockquote>

<p>&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x8BF4;&#x7684;&#xFF0C;&#x65E0;&#x975E;&#x662F;&#x4E9B;&#x788E;&#x788E;&#x5FF5;&#xFF0C;&#x672C;&#x7339;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x4F3C;&#x4E4E;&#x6709;&#x4E86;&#x4E0D;&#x7528; HHKB &#x5C31;&#x6CA1;&#x6CD5;&#x5B89;&#x5FC3;&#x5199;&#x4EE3;&#x7801;&#x5199;&#x7F51;&#x7AD9;&#x7684;&#x6BDB;&#x75C5;&#x3002;</p>
<a id="more"></a>

<p>&#x53EB;&#x558A;&#x7740;&#x5047;&#x671F;&#x8981;&#x5B66;&#x65B0;&#x8BED;&#x8A00;&#x9009;&#x62E9;&#x4E86; Node.js &#x4F5C;&#x4E3A;&#x65B0;&#x76EE;&#x6807;&#xFF0C;&#x5F53;&#x7136;&#x6709;&#x5F88;&#x5927;&#x7684;&#x539F;&#x56E0;&#x662F; Hexo&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x8FD8;&#x662F; Too young too simple, sometimes naive &#x9762;&#x5BF9;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x786C;&#x9AA8;&#x5934;&#x65E0;&#x4ECE;&#x4E0B;&#x53E3;&#xFF0C;&#x60F3;&#x8981;&#x641E;&#x61C2; Node &#x770B;&#x6765;&#x5FC5;&#x987B;&#x4E86;&#x89E3; Javascript&#xFF0C;&#x800C; Javascript &#x4F3C;&#x4E4E;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x5E7F;&#x9614;&#x7684;&#x4E1C;&#x897F;&#x81EA;&#x5DF1;&#x5E76;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x8BE6;&#x5C3D;&#x7684;&#x53C2;&#x8003;&#xFF0C;&#x56DE;&#x5934;&#x53C8;&#x53D1;&#x73B0;&#x524D;&#x7AEF;&#x7684; Javascript &#x597D;&#x591A;&#x5730;&#x65B9;&#x662F;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x62FF;&#x5230;&#x540E;&#x7AEF;&#x7684; Node.js &#x4E0A;&#x7528;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x62B1;&#x7740;&#x77A7;&#x4E00;&#x77A7;&#x770B;&#x4E00;&#x770B;&#x7684;&#x601D;&#x7EF4;&#x7531;&#x6389;&#x8FDB;&#x4E86; CoffeeScript &#x7684;&#x5751;&#xFF0C;&#x7528;&#x4E86;&#x4E24;&#x5929;&#x65F6;&#x95F4;&#x770B;&#x5B8C;&#x4E86; Coffee &#x5B98;&#x7F51;&#x4E0A;&#x7684;&#x6559;&#x7A0B;&#x4E4B;&#x540E;&#x89C9;&#x5F97;&#x4E0D;&#x751A;&#x4E86;&#x89E3;&#x53C8;&#x60F3;&#x7528;&#x8FD9;&#x8D27;&#x5199;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x6628;&#x665A;&#x73A9;&#x7740; UNO &#x5C31;&#x7A81;&#x53D1;&#x5947;&#x60F3;&#x5F00;&#x4E86;&#x4E2A;<a href="https://github.com/AlynxZhou/uno-coffee/" target="_blank">&#x65B0;&#x5751;</a>&#x60F3;&#x7528; CoffeeScript &#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x8054;&#x673A;&#x7684; UNO &#x6E38;&#x620F;&#xFF0C;&#x4ED4;&#x7EC6;&#x60F3;&#x4E86;&#x60F3;&#x53D1;&#x73B0;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7684;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x6253;&#x7B97;&#x8FB9;&#x8D70;&#x8FB9;&#x770B;&#xFF08;&#x5F03;&#x5751;&#x4EC0;&#x4E48;&#x7684;&#x624D;&#x4E0D;&#x4F1A;&#x5462;&#xFF01;&#xFF09;&#xFF0C;&#x597D;&#x50CF;&#x4F3C;&#x4E4E;&#x5927;&#x6982;&#x4E5F;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x5199;&#x4E2A; HTTP Server &#x7528;&#x6765;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x518D;&#x5199;&#x4E2A; HTML5 &#x7684;&#x754C;&#x9762;&#x7136;&#x540E;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x6709;&#x57FA;&#x4E8E; Electron &#x7684;&#x5E94;&#x7528;&#xFF08;&#x795E;&#x554A;&#x6211;&#x518D;&#x4E5F;&#x4E0D;&#x7ED9;&#x81EA;&#x5DF1;&#x7ACB; Flag &#x4E86;&#x6740;&#x4E86;&#x6211;&#x5427;&#xFF01;&#xFF09;&#x3002;</p>
<p>&#x7136;&#x540E;&#x8BF4;&#x7740;&#x4E0A;&#x6B21;&#x7684;&#x6362;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x7528;&#x4E0A;&#x4E86; Atom&#xFF0C;&#x597D;&#x591A;&#x5730;&#x65B9;&#x8FD8;&#x5F97;&#x9002;&#x5E94;&#xFF0C;&#x9996;&#x5148;&#x5C31;&#x662F;&#x4E0D;&#x50CF; Emacs &#x51E0;&#x4E4E;&#x4E00;&#x5957;&#x5FEB;&#x6377;&#x952E;&#x5168;&#x641E;&#x5B9A;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x6A21;&#x4EFF; Emacs &#x952E;&#x4F4D;&#x7684;&#x63D2;&#x4EF6;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x67D0;&#x4E2A;&#x63D2;&#x4EF6;&#x5BFC;&#x81F4; CPU &#x5360;&#x7528;&#x7387;&#x4E0A;&#x5347;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FD8;&#x6CA1;&#x6392;&#x9664;&#xFF0C;&#x603B;&#x4E4B;&#x4EE5;&#x540E;&#x6709;&#x65F6;&#x95F4;&#x4F1A;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x6700;&#x8FD1;&#x5149;&#x662F;&#x628A; Gentoo &#x6362;&#x56DE; Arch Linux &#x5C31;&#x591F;&#x6298;&#x817E;&#x7684;&#x4E86;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x662F;&#x91CD;&#x70B9;&#xFF01;&#x7535;&#x78C1;&#x70AE;&#x771F;&#x662F;&#x592A;&#x53EF;&#x7231;&#x4E86;&#xFF01;</p>
<p>&#x5177;&#x4F53;&#x600E;&#x4E48;&#x6389;&#x8FDB; <strong>&#x67D0;&#x79D1;&#x5B66;&#x7684;&#x8D85;&#x7535;&#x78C1;&#x70AE;/&#x79D1;&#x5B66;&#x8D85;&#x7535;&#x78C1;&#x70AE;</strong> &#x7684;&#x5751;&#x8BF4;&#x6765;&#x5F88;&#x79BB;&#x5947;&#x3002;&#x8003;&#x5B8C;&#x601D;&#x4FEE;&#x7684;&#x4E0B;&#x5348;&#x7D27;&#x63A5;&#x7740;&#x5C31;&#x662F;&#x4E24;&#x5929;&#x5468;&#x672B;&#x4F11;&#x606F;&#xFF0C;&#x4E8E;&#x662F;&#x820D;&#x53CB;&#x9AD8;&#x558A;&#x7740;&#x5E94;&#x8BE5;&#x770B;&#x756A;&#x653E;&#x677E;&#x4E00;&#x4E0B;&#xFF0C;&#x53C8;&#x8865;&#x5145;&#x4E86;&#x4E00;&#x53E5;&#x4E0D;&#x770B;&#x67EF;&#x5357;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x5C31;&#x60F3;&#x8D77;&#x6765;&#x8BF4;&#x770B;&#x7535;&#x78C1;&#x70AE;&#x600E;&#x4E48;&#x6837;&#x6211;&#x4E00;&#x76F4;&#x60F3;&#x770B;&#xFF08;&#x5176;&#x5B9E;&#x6700;&#x65E9;&#x77E5;&#x9053;&#x8D85;&#x70AE;&#x8FD8;&#x662F; Android&#x5427; &#x7684;&#x5E16;&#x5B50; &#x5B89;&#x5427;&#x57FA;&#x4F6C;&#x773C;&#x4E2D;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x5E45; &#x5B89;&#x5427;&#x57FA;&#x4F6C;&#x542C;&#x5230;&#x7535;&#x78C1;&#x70AE; &#x4E0A;&#x9762;&#x5C31;&#x662F;&#x70AE;&#x59D0;&#xFF09;&#xFF0C;&#x7ED3;&#x679C;&#x820D;&#x53CB;&#x62D2;&#x7EDD;&#x4E86;&#xFF0C;&#x6211;&#x5C31;&#x8BF4;&#x90A3;&#x6211;&#x81EA;&#x5DF1;&#x770B;&#x597D;&#x4E86;&#xFF0C;&#x6253;&#x5F00; Bilibili &#x770B;&#x4E86;&#x4E00;&#x96C6;&#xFF0C;&#x53C8;&#x770B;&#x4E86;&#x4E00;&#x96C6;&#xFF0C;&#x53C8;&#x770B;&#x4E86;&#x4E00;&#x96C6;&#xFF0C;&#x53C8;&#x770B;&#x4E86;&#x4E00;&#x96C6;&#x2026;&#x2026;&#x7136;&#x540E;&#x53D1;&#x73B0;&#x7531;&#x4E8E;&#x5B9E;&#x5728;&#x592A;&#x8FC7;&#x597D;&#x770B;&#x5267;&#x60C5;&#x8FDE;&#x8D2F;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x6839;&#x672C;&#x505C;&#x4E0D;&#x4E0B;&#x6765;&#xFF0C;&#x4ECE;&#x516D;&#x70B9;&#x4E00;&#x76F4;&#x5237;&#x5230;&#x665A;&#x4E0A;&#x5341;&#x4E8C;&#x70B9;&#x534A;&#x5237;&#x4E86;1-17&#x96C6;&#xFF08;&#x5176;&#x5B9E;&#x4E8C;&#x5468;&#x76EE;&#x7684;&#x65F6;&#x5019;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x4E0D;&#x5C0F;&#x5FC3;&#x6F0F;&#x6389;&#x4E86;&#x7B2C;&#x56DB;&#x96C6;&#x6240;&#x4EE5;&#x662F;&#x770B;&#x4E86;16&#x96C6;&#xFF09;&#xFF0C;&#x7B2C;&#x4E8C;&#x5929;&#x65E9;&#x4E0A;&#x8D77;&#x5E8A;&#x8FD8;&#x662F;&#x6CA1;&#x5FCD;&#x4F4F;&#x7528;&#x4E86;&#x4E00;&#x4E0A;&#x5348;&#x5237;&#x5B8C;&#x4E86;&#x8D85;&#x70AE;&#x7B2C;&#x4E00;&#x5B63;&#x89C9;&#x5F97;&#x8FD9;&#x5927;&#x6982;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x53D1;&#x73B0;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x547D;&#x756A;&#x7684;&#x611F;&#x89C9;&#x7F8E;&#x7434;&#x662F;&#x771F;&#x7231;&#x554A;&#xFF0C;&#x7136;&#x540E;&#x51B3;&#x5B9A;&#x628A;&#x8D85;&#x70AE;S&#x7F13;&#x5B58;&#x4E0B;&#x6765;&#x7559;&#x5230;&#x56DE;&#x5BB6;&#x7684;&#x706B;&#x8F66;&#x4E0A;&#x770B;&#x3002;&#x8FD9;&#x4E4B;&#x95F4;&#x56E0;&#x4E3A;&#x4E0D;&#x8FC7;&#x763E;&#x53C8;&#x628A;&#x9B54;&#x6CD5;&#x7981;&#x4E66;&#x76EE;&#x5F55;&#x5C0F;&#x8BF4;/&#x52A8;&#x6F2B;&#x91CC;&#x9762;&#x7F8E;&#x7434;&#x51FA;&#x73B0;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x5237;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x4E86;&#x89E3;&#x4E86;&#x5267;&#x60C5;&#x8D70;&#x5411;&#x4E5F;&#x6709;&#x70B9;&#x5931;&#x671B;&#xFF0C;&#x4E8E;&#x662F;&#x53C8;&#x628A;&#x79D1;&#x5B66;&#x8D85;&#x7535;&#x78C1;&#x70AE;&#x7684;&#x6F2B;&#x753B;&#x5237;&#x4E86;&#x4E00;&#x904D;&#xFF08;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x7A9D;&#x4E00;&#x4E2A;&#x4ECE;&#x6765;&#x4E0D;&#x770B;&#x6F2B;&#x753B;&#x7684;&#x4EBA;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x7834;&#x4F8B;&#xFF01;)&#x3002;</p>
<p>&#x8BDD;&#x8BF4;&#x56DE;&#x6765;&#x7A9D;&#x7AD9;&#x5F97;&#x662F;&#x575A;&#x5B9A;&#x7684;&#x9ED1;&#x7434;&#x515A;&#xFF08;&#x6BD5;&#x7ADF;&#x9ED1;&#x7434;&#x515A;&#x5934;&#x9876;&#x9752;&#x5929;&#x811A;&#x8E29;&#x7C7B;&#x4EBA;&#x733F;&#xFF09;&#xFF0C;&#x6CB3;&#x9A6C;&#x8FD9;&#x76F4;&#x7537;&#x764C;+&#x540E;&#x5BAB;&#x5C0F;&#x8BF4;&#x7684;&#x98CE;&#x683C;&#x8FD8;&#x662F;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x9ED1;&#x7434;&#x7684;&#x7ED3;&#x5C40;&#x4F1A;&#x662F; Bad End&#x2026;&#x2026; &#x603B;&#x4E4B;&#x8BF4;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x8FD8;&#x662F;&#x8981;&#x5410;&#x4E00;&#x5927;&#x5806;&#x69FD;&#xFF0C;&#x8D85;&#x70AE;&#x662F;&#x795E;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x539F;&#x4F5C;&#x9B54;&#x7981;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x5BF9;&#x6211;&#x7684;&#x80C3;&#x53E3;&#xFF0C;&#x5F53;&#x9EBB;&#x4EBA;&#x786E;&#x5B9E;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x5634;&#x70AE;+&#x53F3;&#x624B;&#x7684;&#x5237;&#x7EA7;&#x5F00;&#x540E;&#x5BAB;+&#x9B54;&#x6CD5;&#x4FA7;&#x5927;&#x6BD4;&#x91CD;+&#x5404;&#x79CD;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x5723;&#x4EBA;&#x9B54;&#x795E;&#x603B;&#x611F;&#x89C9;&#x662F;&#x8FDB;&#x5165;&#x4E86;&#x7F51;&#x7EDC;&#x5C0F;&#x8BF4;&#x7684;&#x5957;&#x8DEF;&#xFF08;&#x6CA1;&#x9519;&#x8FD8;&#x6709;&#x91CD;&#x8981;&#x4E00;&#x70B9;&#x662F;&#x7A9D;&#x70AE;&#x59D0;&#x540E;&#x671F;&#x5C45;&#x7136;&#x88AB;&#x9B54;&#x795E;&#x548C;&#x67D0;&#x65B0;&#x664B;&#x540E;&#x5BAB;&#x7537;&#x7684;&#x6076;&#x5FC3;&#x540E;&#x5BAB;&#x540A;&#x6253;&#xFF01;&#x800C;&#x4E14;&#x4E5F;&#x5F88;&#x4E0D;&#x723D;&#x70AE;&#x59D0;&#x88AB;&#x4F5C;&#x8005;&#x5212;&#x5F52;&#x5230;&#x5F53;&#x9EBB;&#x7684;&#x540E;&#x5BAB;&#x91CC;&#xFF01;&#x7F8E;&#x7434;&#x662F;&#x9ED1;&#x5B50;&#x7684;&#xFF01;&#x5F53;&#x9EBB;&#x5FEB;&#x56DE;&#x5BB6;&#x62B1;&#x4F60;&#x7684;&#x5C0F;&#x9EC4;&#x4E66;&#x53BB;&#xFF01;&#xFF09;&#x3002;&#x6211;&#x8FD8;&#x662F;&#x559C;&#x6B22;&#x770B;&#x79D1;&#x5B66;&#x4FA7;&#x7684;&#x4E8B;&#x60C5;&#x591A;&#x4E00;&#x70B9;&#x3002;&#x53CD;&#x6B63;&#x8FD9;&#x91CC;&#x6211;&#x4E2A;&#x4EBA;&#x7ED9;&#x5165;&#x5751;&#x7684;&#x4EBA;&#x4E00;&#x70B9;&#x63D0;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x9B54;&#x7981;&#x5165;&#x5751;&#x7684;&#x8BDD;&#x5C31;&#x628A;&#x9B54;&#x7981;&#x7684;&#x5C0F;&#x8BF4;&#x548C;&#x52A8;&#x6F2B;&#x770B;&#x5B8C;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x8981;&#x662F;&#x8D85;&#x70AE;&#x5165;&#x5751;&#x7684;&#x5EFA;&#x8BAE;&#x6309;&#x7167;&#x8D85;&#x70AE;&#x3001;&#x8D85;&#x70AE;ova&#x3001;&#x8D85;&#x70AE;S&#x7684;&#x6B63;&#x5E38;&#x987A;&#x5E8F;&#x770B;&#x5B8C;&#x8D85;&#x70AE;&#x52A8;&#x6F2B;&#x7136;&#x540E;&#x8FFD;&#x8D85;&#x70AE;&#x7684;92&#x8BDD;&#x6F2B;&#x753B;&#x8FDE;&#x8F7D;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x7B49;&#x5929;&#x56FD;&#x7684;&#x9B54;&#x7981;&#x4E09;&#x51FA;&#x4E86;&#x4E4B;&#x540E;&#x7684;&#x8D85;&#x70AE;&#x4E09;&#x4E86;&#xFF08;&#x9B54;&#x7981;&#x5C0F;&#x8BF4;&#x6700;&#x8FD1;&#x51E0;&#x5377;&#x4F5C;&#x7684;&#x6B7B;&#x5BFC;&#x81F4;&#x9500;&#x91CF;&#x4E0B;&#x6ED1;&#x6240;&#x4EE5;&#x6211;&#x89C9;&#x5F97;&#x9B54;&#x7981;&#x4E09;&#x662F;&#x6709;&#x5E0C;&#x671B;&#x7684;&#xFF09;&#xFF0C;&#x5343;&#x4E07;&#x522B;&#x78B0;&#x9B54;&#x7981;&#x4E00;&#x70B9;&#x4EE5;&#x9632;&#x6B62;&#x4F60;&#x88AB;&#x6076;&#x5FC3;&#x5230;&#xFF01;</p>
<p>&#x5C31;&#x7B97;&#x5E0C;&#x671B;&#x6E3A;&#x832B;&#xFF0C;&#x6211;&#x4E5F;&#x575A;&#x4FE1;&#x7F8E;&#x7434;&#x5BF9;&#x5F53;&#x9EBB;&#x5E76;&#x4E0D;&#x662F;&#x559C;&#x6B22;&#xFF0C;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x9047;&#x5230;&#x4E86;&#x529B;&#x91CF;&#x6BD4;&#x81EA;&#x5DF1;&#x5F3A;&#x7684;&#x4EBA;&#xFF0C;&#x5173;&#x7CFB;&#x6BD4;&#x8F83;&#x5BC6;&#x5207;&#x800C;&#x5DF2;&#xFF0C;&#x7F8E;&#x7434;&#x548C;&#x9ED1;&#x5B50;&#x4E5F;&#x5E76;&#x4E0D;&#x662F;&#x540C;&#x6027;&#x604B;&#xFF0C;&#x53EA;&#x662F;&#x6070;&#x5DE7;&#x6700;&#x5408;&#x9002;&#x81EA;&#x5DF1;&#x7684;&#x4EBA;&#x6027;&#x522B;&#x76F8;&#x540C;&#x800C;&#x5DF2;&#x3002;&#x9ED1;&#x5B50;&#x624D;&#x662F;&#x5728;&#x7F8E;&#x7434;&#x5FC3;&#x4E2D;&#x7279;&#x522B;&#x7684;&#x5B58;&#x5728;&#x5427;&#x3002;&#x6211;&#x5B81;&#x53EF;&#x4E0D;&#x8981;&#x4EC0;&#x4E48;&#x5929;&#x56FD;&#x7684;&#x9B54;&#x7981;&#x4E09;&#xFF0C;&#x4E5F;&#x8981;&#x9ED1;&#x7434;&#x7684; Happy End&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x7684;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x79D1;&#x5B66;&#x4FA7;&#x7684;&#x8D85;&#x7535;&#x78C1;&#x70AE;&#x3001;&#x5E38;&#x76D8;&#x53F0;&#x7684;&#x738B;&#x724C;&#x3001;&#x65E0;&#x654C;&#x7684;&#x7535;&#x51FB;&#x516C;&#x4E3B;&#x3001;&#x88AB;&#x7535;&#x5B50;&#x5BA0;&#x7231;&#x7684;&#x5929;&#x8D50;&#x4E4B;&#x5B50;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5FA1;&#x5742;&#x7F8E;&#x7434;&#x8FD9;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x5F62;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x526A;&#x5F71;&#x800C;&#x5DF2;&#xFF0C;&#x5979;&#x65E2;&#x6709;&#x8FD9;&#x4E9B;&#x4F18;&#x70B9;&#xFF0C;&#x4E5F;&#x662F;&#x7231;&#x597D;&#x5E7C;&#x7A1A;&#x3001;&#x4E2A;&#x6027;&#x96BE;&#x4EE5;&#x6349;&#x6478;&#x3001;&#x6709;&#x6559;&#x79D1;&#x4E66;&#x5F0F;&#x50B2;&#x5A07;&#x3001;&#x4E3A;&#x4E86;&#x522B;&#x4EBA;&#x4E0D;&#x60DC;&#x727A;&#x7272;&#x751F;&#x547D;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x5343;&#x4E07;&#x53E5;Bilibili&#x4E5F;&#x62B5;&#x4E0D;&#x4E0A;&#x4E00;&#x53E5;Ouneisama&#x3002;</p>
<p>&#x81EA;&#x5DF1;&#x6574;&#x7406;&#x7684;&#x8D85;&#x7535;&#x78C1;&#x70AE;&#x6709;&#x5173;&#x7684;&#x6B4C;&#x5355;&#x672C;&#x6765;&#x60F3;&#x8D34;&#x4E0A;&#x6765;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x7248;&#x6743;&#x539F;&#x56E0;&#x65E0;&#x6CD5;&#x751F;&#x6210;&#x5916;&#x94FE;&#x64AD;&#x653E;&#x5668;&#xFF0C;&#x90A3;&#x5C31;&#x8D34;&#x8FD9;&#x9996;&#x5427;&#x3002;</p>
<iframe frameborder="no" border="0" marginwidth="0" marginheight="0" width="330" height="86" src="//music.163.com/outchain/player?type=2&amp;id=33913797&amp;auto=0&amp;height=66"></iframe>

<p><strong>&#x4F60;&#x6307;&#x5C16;&#x8DC3;&#x52A8;&#x7684;&#x7535;&#x5149;&#xFF0C;&#x662F;&#x6211;&#x6B64;&#x751F;&#x4E0D;&#x53D8;&#x7684;&#x4FE1;&#x4EF0;&#xFF0C;&#x552F;&#x6211;&#x8D85;&#x7535;&#x78C1;&#x70AE;&#x6C38;&#x4E16;&#x957F;&#x5B58;&#xFF01;</strong></p>
<p><em>AlynxZhou</em></p>
<p><strong>A Coder &amp; Dreamer</strong></p>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/%E9%9A%8F%E8%AE%B0/" rel="tag"><i class="fas fa-tag"></i>随记</a><a class="post-tag button" href="/tags/%E6%9C%AC%E5%91%BD%E7%95%AA/" rel="tag"><i class="fas fa-tag"></i>本命番</a><a class="post-tag button" href="/tags/%E6%8A%98%E8%85%BE/" rel="tag"><i class="fas fa-tag"></i>折腾</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
      <a href="/posts/Steam-with-Bumblebee/" rel="next" title="Linux下使Steam调用Bumblebee使用独显"><i class="fas fa-angle-left"></i><span class="nav-title">Linux下使Steam调用Bumblebee使用独显</span></a>
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/posts/Some-Thoughts/" rel="prev" title="一些想法"><span class="nav-title">一些想法</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
<div class="reward" id="reward">
  <p>既然看了喵写的文章，不打算投喂一下再走吗？哼！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>打赏</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechat">
      <img id="wechat_qr" src="/images/WeChatPay.png" alt="微信支付"/>
      <span>微信支付</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay_qr" src="/images/AliPay.png" alt="支付宝"/>
      <span>支付宝</span>
    </div>
    
    
  </div>
</div>


  
  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "AlynxZhou",
      "repo": "stackharbor.alynx.xyz",
      "clientID": "",
      "clientSecret": "6db7dd16477eadc1e96160a23c6ba4cf687dcecf",
      "no_comment": "这个页面还没有评论，现在就去评论吧！",
      "go_to_comment": "去评论",
      "issue_title": "碎碎念",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="搜索" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/saber.png" alt="AlynxZhou">
  
  <h1 class="author-name">AlynxZhou</h1>
  <h2 class="author-description">Everything that lives is designed to end.</h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">归档</div>
      <div><a href="/archives/">49</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">分类</div>
      <div><a href="/categories/">38</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">标签</div>
      <div><a href="/tags/">61</a></div>
    </div>
    
    
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>社交链接</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:alynx.zhou@gmail.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/AlynxZhou/" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-telegram-plane"></i><a href="https://t.me/AlynxZhou/" target="_blank">Telegram</a></li>
        
        <li><i class="fas fa-video"></i><a href="https://space.bilibili.com/10034969/" target="_blank">Bilibili</a></li>
        
        <li><i class="fab fa-weibo"></i><a href="https://weibo.com/u/5287501461" target="_blank">Weibo</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>友情链接</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://lrscy.github.io/" target="_blank">Meow's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://lgiki.cc/" target="_blank">LGiki's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://hackghost.com/" target="_blank">Hack Ghost's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://chenxy.moe/" target="_blank">Art_Chen's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jm33.me/" target="_blank">Jm33_m0's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://farseerfc.me/" target="_blank">Farseerfc 的小窝</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://huaji.store/" target="_blank">滑稽仓库</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jitui.moe/" target="_blank">鸡腿工坊</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sh.yorushika.live/" target="_blank">月十</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sqyon.com/" target="_blank">sqyon</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #33363b;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="回到顶部"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>AlynxZhou</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-sa/4.0/" target="_blank">BY-NC-SA 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="站点点击量" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="站点用户数" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="页面点击量" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          托管于<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">GitHub Pages</a>
          
        </div>
        <div class="powered-by">
          由 <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a> 强力驱动<i class="fab fa-node-js"></i>主题 <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
<!-- Page built by Hikaru v1.13.1 at 2019-01-14 周一 20:55:09 CST. -->
