<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    
    <meta name="theme-color" content="#33363b">
    <meta name="msapplication-TileColor" content="#33363b">
    
    
    <meta name="google-site-verification" content="VmX1m6eF3rZhAf1iR5DhqrbiF_5se-s902W14pPryQk">
    
    
    <meta name="keywords" content="Code, Music, Life, Linux, Arch Linux, Gentoo, JavaScript, ARIA, Hikaru">
    
    
    <link rel="apple-touch-icon" sizes="180x180" href="/favicons/apple-touch-icon.png">
    
    
    <link rel="icon" type="image/png" sizes="192x192" href="/favicons/android-chrome-192x192.png">
    
    
    <link rel="icon" type="image/png" sizes="32x32" href="/favicons/favicon-32x32.png">
    
    
    <link rel="icon" type="image/png" sizes="16x16" href="/favicons/favicon-16x16.png">
    
    
    <link rel="mask-icon" href="/favicons/safari-pinned-tab.svg" color="#33363b">
    
    
    <link rel="manifest" href="/favicons/site.webmanifest">
    
    
    <meta name="msapplication-config" content="/favicons/browserconfig.xml">
    
    
    <link rel="shortcut icon" type="image/x-icon" href="/favicons/favicon.ico">
    
    
    <link rel="alternate" href="/atom.xml" title="喵's StackHarbor" type="application/atom+xml" />
    
    
    <link rel="stylesheet" type="text/css" href="/css/normalize.css">
    <link rel="stylesheet" type="text/css" href="/css/index.css">
    
    <link rel="stylesheet" type="text/css" href="/css/sidebar.css">
    
    
<link rel="stylesheet" type="text/css" href="/css/page.css">
<link rel="stylesheet" type="text/css" href="/css/post.css">

    <link rel="stylesheet" type="text/css" href="/css/custom.css">
    <link rel="stylesheet" type="text/css" href="/css/atom-one-dark.css">
    <link rel="stylesheet" type="text/css" href="/css/lightgallery.min.css">
    <script type="text/javascript" src="/js/jquery.min.js"></script>
    <script defer type="text/javascript" src="/js/util.js"></script>
    <script defer type="text/javascript" src="/js/scrollspy.js"></script>
    <script defer type="text/javascript" src="/js/fontawesome-all.min.js"></script>
    <script defer type="text/javascript" src="/js/lightgallery.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-fullscreen.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-hash.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-pager.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-thumbnail.min.js"></script>
    <script defer type="text/javascript" src="/js/lg-zoom.min.js"></script>
    
    <script defer src="/js/busuanzi.pure.mini.js"></script>
    
    
    <script defer type="text/javascript" src="/js/search.js"></script>
    <script type="text/javascript">
    $(document).ready(function () {
      var searchPath = "/search.json";
      if ("search.json".length === 0) {
        searchPath = "/search.json";
      }
      searchFunc(searchPath, "search-input", "search-result");
    });
    </script>
    
    
    <script defer type="text/javascript" src="/js/index.js"></script>
    
    <script defer type="text/javascript" src="/js/custom.js"></script>
    <title>StackHarbor 的 2018 尾记 | 喵's StackHarbor - Whisper to the World</title>
  </head>
  <body itemscope itemtype="http://schema.org/WebPage" lang="zh_CN"  data-spy="scroll" data-target=".list-group">
    
<header id="header" class="header" style="background: #33363b;">
  <div class="container">
    <div class="header-container">
      <div class="header-title">
        <h1 class="title"><a href="/">喵's StackHarbor</a></h1>
        <h2 class="subtitle">Whisper to the World</h2>
      </div>
      
      <div class="logo">
        <img src="/images/logo.png" alt="logo">
      </div>
      
    </div>
    <nav id="nav" class="nav">
      <a id="nav-toggle" class="nav-toggle" aria-hidden="true"><i class="fas fa-bars" aria-label="切换导航栏"></i></a>
      <ul id="menu" role="menubar" aria-hidden="false">
        
        <li role="menuitem"><a href="/"><i class="fas fa-home"></i><span class="menu-text">首页</span></a></li>
        
        <li role="menuitem"><a href="/archives/"><i class="fas fa-archive"></i><span class="menu-text">归档</span></a></li>
        
        <li role="menuitem"><a href="/categories/"><i class="fas fa-th-list"></i><span class="menu-text">分类</span></a></li>
        
        <li role="menuitem"><a href="/tags/"><i class="fas fa-tags"></i><span class="menu-text">标签</span></a></li>
        
        <li role="menuitem"><a href="/Undefined-Shell-Works/"><i class="fas fa-terminal"></i><span class="menu-text">Undefined Shell Works!</span></a></li>
        
        <li role="menuitem"><a href="/about/"><i class="fas fa-user-edit"></i><span class="menu-text">关于</span></a></li>
        
      </ul>
    </nav>
  </div>
</header>


    <main id="main" class="main">
      <div class="container">
        <div class="main-container">
          <div class="content">
            
<div id="post" class="page">
  <article class="article post card animate" itemscope itemtype="http://schema.org/Article">
    <div class="post-block">
      <link itemprop="mainEntityOfPage" href="https://sh.alynx.xyz/posts/2018-Tail/">
      <span hidden itemprop="author" itemscope itemtype="http://schema.org/Person">
        <meta itemprop="name" content="AlynxZhou">
        <meta itemprop="description" content="Everything that lives is designed to end.">
        <meta itemprop="image" content="/images/Future_Gazer_small.png">
      </span>
      <span hidden itemprop="publisher" itemscope itemtype="http://schema.org/Organization">
        <meta itemprop="name" content="喵's StackHarbor">
      </span>
    </div>
    <header class="post-header">
      <h1 class="post-title" itemprop="name headline">StackHarbor 的 2018 尾记</h1>
      <div class="post-meta">
        
        <span class="post-date meta-block">
          <i class="far fa-calendar-plus"></i><span><time title="post-date" itemprop="dateCreated datePublished" datetime="2018-12-31T08:14:32.000Z">2018-12-31 周一 16:14:32 CST</time></span>
        </span>
        
        
        <span class="post-categories meta-block">
          
          <i class="far fa-folder-open"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/" itemprop="url" rel="index"><span itemprop="name">随记</span></a></span><i class="fas fa-angle-right"></i><span itemprop="about" itemscope itemtype="http://schema.org/Thing"><a href="/categories/%E9%9A%8F%E8%AE%B0/%E7%94%9F%E6%B4%BB/" itemprop="url" rel="index"><span itemprop="name">生活</span></a></span>
        </span>
        
        
        
        
      </div>
    </header>
    <main class="post-main" itemprop="articleBody">
      <p><img src="/posts/2018-Tail/2B.jpg" alt=""></p>
<p>&#x8FD8;&#x6CA1;&#x6709;&#x5230;&#x6708;&#x4EAE;&#x5347;&#x8D77;&#x7684;&#x65F6;&#x5019;&#x5462;&#x3002;</p>
<a id="more"></a>

<p>&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7279;&#x6B8A;&#x7684;&#x65E5;&#x5B50;&#x90FD;&#x80FD;&#x8BA9;&#x4EBA;&#x5F00;&#x5FC3;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x8BB0;&#x6027;&#x4E0D;&#x592A;&#x597D;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x3002;&#x867D;&#x7136;&#x8DDD;&#x79BB;&#x4E0A;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x6807;&#x9898;&#x7684;&#x5DF2;&#x7ECF;&#x8FC7;&#x4E86;&#x4E00;&#x5E74;&#xFF0C;&#x4F46;&#x6211;&#x4F3C;&#x4E4E;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x8FD9;&#x4E00;&#x5E74;&#x6709;&#x4EC0;&#x4E48;&#x503C;&#x5F97;&#x5F00;&#x5FC3;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x6211;&#x662F;&#x6307;&#x90A3;&#x79CD;&#x80FD;&#x7EF4;&#x6301;&#x5F88;&#x4E45;&#x7684;&#x5F00;&#x5FC3;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x9057;&#x61BE;&#x4F3C;&#x4E4E;&#x8BA9;&#x4EBA;&#x96BE;&#x8FC7;&#x7684;&#x4E8B;&#x60C5;&#x603B;&#x662F;&#x80FD;&#x6301;&#x7EED;&#x7684;&#x66F4;&#x4E45;&#x4E00;&#x70B9;&#x3002;</p>
<p>&#x4ECA;&#x5E74;&#x5927;&#x6982;&#x4FDD;&#x8BC1;&#x4E86;&#x4E00;&#x4E2A;&#x6708;&#x4E00;&#x7BC7; post &#x7684;&#x9891;&#x7387;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x4E9B;&#x6708;&#x4EFD;&#x5C31;&#x61D2;&#x7684;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x60F3;&#x5E72;&#xFF0C;&#x4F46;&#x56DE;&#x5934;&#x7FFB;&#x4E00;&#x7FFB;&#x4E4B;&#x524D;&#x8FD8;&#x6709;&#x5B58;&#x8D27;&#xFF0C;&#x8BA9;&#x4EBA;&#x53D8;&#x61D2;&#x7684;&#x539F;&#x56E0;&#x4E0D;&#x662F;&#x65E0;&#x4E8B;&#x53EF;&#x505A;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x7531;&#x4E8E;&#x5404;&#x79CD;&#x6CA1;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x8FD8;&#x4E0D;&#x5F97;&#x4E0D;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E00;&#x65E6;&#x6C89;&#x8FF7;&#x5728;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x91CC;&#x592A;&#x4E45;&#xFF0C;&#x5C31;&#x5BB9;&#x6613;&#x8BA9;&#x4EBA;&#x5FD8;&#x8BB0;&#x81EA;&#x5DF1;&#x5E94;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x4F3C;&#x4E4E;&#x8FD9;&#x4E00;&#x5E74;&#x6765;&#x5C31;&#x4E00;&#x76F4;&#x4E0D;&#x6E05;&#x695A;&#x81EA;&#x5DF1;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x867D;&#x7136;&#x5BF9;&#x4E8E;&#x81EA;&#x5DF1;&#x4E0D;&#x60F3;&#x505A;&#x4EC0;&#x4E48;&#x6709;&#x6E05;&#x6670;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x8BF4;&#x5230;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4F3C;&#x4E4E;&#x6BCF;&#x4E00;&#x4EF6;&#x4E8B;&#x90FD;&#x4E0D;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x5B8C;&#x6210;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E00;&#x4E9B;&#x6CA1;&#x63A5;&#x89E6;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x800C;&#x4E14;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x8FD8;&#x4F1A;&#x7EE7;&#x7EED;&#x5B58;&#x5728;&#x4E0B;&#x53BB;&#x2014;&#x2014;&#x6211;&#x8FD8;&#x6CA1;&#x641E;&#x5230;&#x8BE5;&#x6B7B;&#x7684;&#x521B;&#x65B0;&#x521B;&#x4E1A;&#x5B66;&#x5206;&#xFF01;</p>
<p>&#x8BF4;&#x53E5;&#x5B9E;&#x5728;&#x8BDD;&#xFF0C;&#x6211;&#x4E0D;&#x60F3;&#x5F53;&#x97ED;&#x83DC;&#xFF0C;&#x4E5F;&#x6CA1;&#x5F53;&#x97ED;&#x83DC;&#x7684;&#x6210;&#x672C;&#x3002;&#x6211;&#x8FD8;&#x6709;&#x597D;&#x591A;&#x4E8B;&#x60C5;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#x5462;&#xFF01;&#x5927;&#x6982;&#x5BF9;&#x4E8E;&#x4E00;&#x68F5;&#x97ED;&#x83DC;&#x6765;&#x8BF4;&#xFF0C;&#x957F;&#x5F97;&#x548C;&#x5176;&#x4ED6;&#x97ED;&#x83DC;&#x4E0D;&#x4E00;&#x6837;&#x5C31;&#x662F;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6700;&#x8FD1;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x503C;&#x5F97;&#x5F00;&#x5FC3;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x66F4;&#x8FDC;&#x4E00;&#x4E9B;&#x4E5F;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4ECE;&#x6700;&#x65E9;&#x5F00;&#x59CB;&#x8BF4;&#x7684;&#x8BDD;&#xFF0C;&#x4ECA;&#x5E74;&#x5927;&#x6982;&#x4ECE; <em>&#x7A7A;&#x4E4B;&#x5883;&#x754C;</em> &#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x662F; <em>Fate/Stay Night</em>&#xFF0C;&#x7136;&#x540E;&#x662F; <em>Fate/Zero</em>&#x3002;&#x7B2C;&#x4E00;&#x904D;&#x770B;&#x7A7A;&#x4E4B;&#x5883;&#x754C;&#x7684;&#x65F6;&#x5019;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x6574;&#x4E2A;&#x5728;&#x8BF4;&#x4EC0;&#x4E48;&#xFF0C;&#x53EA;&#x662F;&#x6A21;&#x7CCA;&#x5730;&#x89C9;&#x5F97;&#x5341;&#x5206;&#x559C;&#x6B22;&#xFF0C;&#x6700;&#x8FD1;&#x53C8;&#x62FF;&#x8D77;&#x6765;&#x91CD;&#x65B0;&#x770B;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x610F;&#x601D;&#x3002;</p>
<p>&#x8BDD;&#x8BF4;&#x56DE;&#x6765;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x6709;&#x5341;&#x5206;&#x719F;&#x6089;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x56E0;&#x4E3A;&#x91CC;&#x9762;&#x4E00;&#x4E9B;&#x63D2;&#x66F2;&#x65E9;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x5FAA;&#x73AF;&#x4E86;&#x591A;&#x5C11;&#x4E2A;&#x6DF1;&#x591C;&#x7684;&#x539F;&#x56E0;&#x3002;&#x603B;&#x6709;&#x4E00;&#x4E9B;&#x65CB;&#x5F8B;&#x662F;&#x505C;&#x7559;&#x5728;&#x8BB0;&#x5FC6;&#x91CC;&#x9762;&#x7684;&#xFF0C;&#x7406;&#x89E3;&#x5B83;&#x4EEC;&#x4ECE;&#x6765;&#x5C31;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x7136;&#x540E;&#x662F; Fate&#xFF0C;&#x6700;&#x5F00;&#x59CB;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x628A; <em>&#x536B;&#x5BAB;&#x5BB6;&#x4ECA;&#x5929;&#x7684;&#x996D;</em> &#x5F53;&#x6210;&#x6CE1;&#x9762;&#x756A;&#x6765;&#x770B;&#x7684;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x4E00;&#x4E0B;&#x5B50;&#x5C31;&#x70B9;&#x5F00;&#x4E86;&#x4E00;&#x5E74;&#x9738;&#x6743;&#xFF08;&#x771F;&#xB7;&#x5E74;&#x756A;&#xFF09;&#x3002;&#x5F53;&#x7136;&#x770B;&#x8FC7; Stay Night &#x4E4B;&#x540E;&#x548C;&#x6CA1;&#x770B;&#x4E4B;&#x524D;&#x770B;&#x8FD9;&#x90E8;&#x7684;&#x611F;&#x89C9;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x2014;&#x2014;&#x4E00;&#x540C;&#x7ECF;&#x5386;&#x8FC7;&#x5F88;&#x591A;&#xFF0C;&#x600E;&#x4E48;&#x80FD;&#x4E0D;&#x7559;&#x4E0B;&#x4E9B;&#x75D5;&#x8FF9;&#x5462;&#x2014;&#x2014;&#x5927;&#x6982;&#x548C;&#x6240;&#x6709;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x53EA;&#x8981;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x8FD8;&#x5728;&#x4E00;&#x8D77;&#x5C31;&#x6EE1;&#x8DB3;&#x4E86;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5927;&#x6982; Unlimited Blade Works &#x7EBF;&#x7684;&#x52A8;&#x753B;&#x4ECE;&#x97F3;&#x4E50;&#x4E0A;&#x6574;&#x4E2A;&#x5C31;&#x8F93;&#x7ED9;&#x4E86; Fate &#x7EBF;&#x52A8;&#x753B;&#xFF0C;&#x9664;&#x4E86; LAST STARDUST &#x662F;&#x786E;&#x786E;&#x5B9E;&#x5B9E;&#x7684;&#x8D85;&#x6C34;&#x5E73;&#xFF0C;believe &#x548C; ring your bell &#x8868;&#x73B0;&#x5B9E;&#x9645;&#x5F88;&#x4E00;&#x822C;&#xFF08;&#x8FD9;&#x91CC;&#x4E00;&#x822C;&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;&#x6307;&#x6CA1;&#x4EC0;&#x4E48;&#x7B2C;&#x4E00;&#x904D;&#x5C31;&#x5438;&#x5F15;&#x4EBA;&#x7684;&#x5730;&#x65B9;&#xFF09;&#x3002;Fate/Zero &#x4E5F;&#x662F;&#x5B8C;&#x5B8C;&#x5168;&#x5168;&#x7684;&#x8D85;&#x51FA; Unlimited Blade Works &#x7684;&#x97F3;&#x4E50;&#xFF08;&#x53EA;&#x8981;&#x628A;&#x6EE1;&#x5929;&#x62C9;&#x51FA;&#x6765;&#x5C31;&#x53EF;&#x4EE5;&#x540A;&#x6253;&#x4E86;&#xFF09;&#xFF0C;&#x81F3;&#x4E8E; 2019 &#x5E74; 1 &#x6708; 11 &#x65E5;&#x7684; Heaven&apos;s Feel&#x2026;&#x2026;&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x6A31;&#x53A8;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x6982;&#x8FD9;&#x6761;&#x7EBF;&#x4E0D;&#x9002;&#x5408;&#x6211;&#x5427;&#x3002;&#x8FD8;&#x6709; <em>&#x5E7B;&#x60F3;&#x5609;&#x5E74;&#x534E;</em> &#x5927;&#x6982;&#x548C;&#x536B;&#x5BAB;&#x5BB6;&#x4ECA;&#x5929;&#x7684;&#x996D;&#x662F;&#x540C;&#x4E00;&#x6C34;&#x5E73;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x592A;&#x4E25;&#x8083;&#x4E86;&#x4E5F;&#x662F;&#x5F88;&#x7D2F;&#x7684;&#x3002;&#x81F3;&#x4E8E; <em>Fate/Apocrypha</em>&#xFF1F;&#x8FD9;&#x4E0D;&#x662F;&#x8BB2;&#x7684;&#x83AB;&#x5FB7;&#x96F7;&#x5FB7;&#x548C;&#x72EE;&#x5B50;&#x52AB;&#x754C;&#x79BB;&#x7684;&#x6545;&#x4E8B;&#x561B;&#xFF1F;&#x5199;&#x7684;&#x633A;&#x597D;&#x7684;&#xFF01;&#x5C31;&#x662F; 23 &#x96C6;&#x5C31;&#x5B8C;&#x7ED3;&#x6709;&#x70B9;&#x5947;&#x602A;&#x2026;&#x2026;&#x540E;&#x9762;&#x8FD8;&#x505A;&#x4E24;&#x96C6;&#x591A;&#x4F59;&#x7684;&#x9A97;&#x6536;&#x89C6;&#x7387;&#x561B;&#xFF1F;&#xFF08;&#x6478;&#x7740;&#x826F;&#x5FC3;&#x8BF4;&#xFF0C;&#x963F;&#x798F;&#x8FD9;&#x4E2A;&#x914D;&#x89D2;&#x4E5F;&#x633A;&#x53EF;&#x7231;&#x7684;&#x3002;&#xFF09;</p>
<p>Fate &#x7CFB;&#x5217;&#x5176;&#x4ED6;&#x7684;&#x4F5C;&#x54C1;&#x5C31;&#x6CA1;&#x770B;&#x8FC7;&#x4E86;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x4E5F;&#x6CA1;&#x6709;&#x770B;&#x7684;&#x5FC5;&#x8981;&#xFF0C;FGO &#x4ECE;&#x770B;&#x5B8C; Stay Night &#x5F00;&#x59CB;&#x73A9;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x4E5F;&#x5DEE;&#x4E0D;&#x591A;&#x6CA1;&#x4EC0;&#x4E48;&#x52A8;&#x529B;&#x4E86;&#xFF08;&#x4E3B;&#x8981;&#x662F;&#x61D2;&#xFF09;&#xFF0C;&#x53CD;&#x6B63;&#x4E00;&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6211;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x62BD;&#x5230;&#x84DD;&#x5446;&#x6BDB;&#x3002;&#xFF08;93 &#x8FDE;&#x62BD;&#xFF01;279 &#x4E2A;&#x77F3;&#x5934;&#xFF01;&#x4E00;&#x4E2A;&#x4E94;&#x661F;&#x90FD;&#x6CA1;&#x6709;&#xFF01;&#xFF09;&#x867D;&#x7136;&#x91D1;&#x5361;&#x6709;&#x4E86;&#x4E00;&#x5927;&#x5806;&#x4E00;&#x822C;&#x7684;&#x672C;&#x4E5F;&#x90FD;&#x8F7B;&#x8F7B;&#x677E;&#x677E;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x5F88;&#x60F3;&#x8981;&#x84DD;&#x5446;&#x3002;&#xFF08;&#x65E0;&#x72EC;&#x6709;&#x5076;&#xFF0C;&#x4FE1;&#x7528;&#x5361;&#x6211;&#x4E5F;&#x53EA;&#x62FF;&#x5230;&#x6B66;&#x85CF;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x84DD;&#x5446;&#x3002;&#xFF09;&#x660E;&#x5E74;&#x6709;&#x7B2C;&#x516D;&#x4E03;&#x7AE0;&#x7684;&#x52A8;&#x753B;&#x5316;&#xFF0C;&#x7B2C;&#x4E03;&#x7AE0;&#x6211;&#x53EA;&#x662F;&#x89C9;&#x5F97;&#x6545;&#x4E8B;&#x6027;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x7B2C;&#x516D;&#x7AE0;&#x7684;&#x52A8;&#x753B;&#x662F;&#x6211;&#x6700;&#x671F;&#x5F85;&#x7684;&#x3002;</p>
<p>&#x5BFC;&#x81F4;&#x4E0D;&#x5F00;&#x5FC3;&#x7684;&#x5927;&#x6982;&#x662F;&#x5728;&#x6211;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x542C; Kalafina &#x7684;&#x65F6;&#x5019;&#x542C;&#x89C1;&#x4E86; Keiko &#x9000;&#x51FA;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x613F;&#x610F;&#x56DE;&#x60F3;&#x8FD9;&#x4EF6;&#x4E8B;&#x53D1;&#x751F;&#x7684;&#x524D;&#x540E;&#x8FC7;&#x7A0B;&#x3002;&#x65E0;&#x8BBA;&#x5E0C;&#x671B;&#x8FD8;&#x662F;&#x5931;&#x671B;&#x4E5F;&#x90FD;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x90A3;&#x5269;&#x4E0B;&#x7684;&#x590D;&#x6742;&#x7684;&#x611F;&#x60C5;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E0E;&#x5176;&#x7A7A;&#x6000;&#x5E0C;&#x671B;&#xFF0C;&#x4E0D;&#x5982;&#x8BA9;&#x65F6;&#x95F4;&#x56DE;&#x5230;&#x4E00;&#x5207;&#x8FD8;&#x6CA1;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x91CD;&#x6765;&#x4E00;&#x904D;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x9519;&#x8FC7;&#x90A3;&#x4E9B;&#x4E0D;&#x8BE5;&#x9519;&#x8FC7;&#x7684;&#x673A;&#x4F1A;&#x4E86;&#x5427;&#x3002;&#x4E0E;&#x5DF2;&#x7ECF;&#x5F97;&#x4E0D;&#x5230;&#x7684;&#x76F8;&#x6BD4;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x91CD;&#x590D;&#x7684;&#x65E0;&#x804A;&#x4E8B;&#x60C5;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x5417;&#xFF1F;</p>
<p>&#x987A;&#x4FBF;&#x4E00;&#x63D0;&#xFF0C;&#x5047;&#x671F;&#x4E4B;&#x524D;&#x901A;&#x5173;&#x4E86; NieR: Automata&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x7684;&#x6211;&#x6050;&#x6015;&#x6CA1;&#x6709;&#x518D;&#x6765;&#x4E00;&#x6B21;&#x7684;&#x52C7;&#x6C14;&#x3002;</p>
<p>&#x4E5F;&#x8BB8;&#x6211;&#x53EF;&#x4EE5;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#x53EF;&#x4EE5;&#x505A;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x4F5C;&#x54C1;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x73B0;&#x5728;&#x6B63;&#x5728;&#x7528;&#x7684;&#x4E3B;&#x9898; ARIA&#xFF0C;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x5B83;&#x548C;&#x6211;&#x7684;&#x60F3;&#x6CD5;&#x4E00;&#x6837;&#x7B80;&#x5355;&#xFF0C;&#x672C;&#x6765;&#x5C31;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x903B;&#x8F91;&#x561B;&#x3002;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5199;&#x7684;&#x975E;&#x5E38;&#x76F4;&#x767D;&#xFF0C;&#x6837;&#x5F0F;&#x4E5F;&#x5168;&#x90E8;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x5947;&#x602A;&#x7684;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x8C03;&#x7528;&#x3002;&#x4E5F;&#x6CA1;&#x6709;&#x5BF9;&#x4E00;&#x4E9B;&#x5386;&#x53F2;&#x5783;&#x573E;&#x8FDB;&#x884C;&#x6CA1;&#x5FC5;&#x8981;&#x7684;&#x9002;&#x914D;&#xFF0C;&#x76F4;&#x63A5;&#x91C7;&#x7528;&#x6700;&#x5408;&#x9002;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x53BB;&#x6389;&#x90A3;&#x4E9B;&#x5BF9;&#x5185;&#x5BB9;&#x6CA1;&#x4EC0;&#x4E48;&#x5E2E;&#x52A9;&#x8FD8;&#x6D88;&#x8017;&#x8D44;&#x6E90;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x597D;&#x4E86;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x662F; Hikaru&#xFF0C;&#x57FA;&#x4E8E;&#x548C;&#x4E0A;&#x9762;&#x7C7B;&#x4F3C;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x5BF9; Hexo &#x4E5F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x4E0D;&#x6EE1;&#xFF0C;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x5176;&#x5B83;&#x7684;&#x8BA9;&#x6211;&#x66F4;&#x6CA1;&#x4EC0;&#x4E48;&#x5174;&#x8DA3;&#x3002;&#x4E8E;&#x662F;&#x5927;&#x81F4;&#x6309;&#x7167;&#x903B;&#x8F91;&#x8BBE;&#x8BA1;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6210;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x7ED9;&#x5B83;&#x8D77;&#x4E86;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x6B4C;&#x624B;&#x7684;&#x540D;&#x5B57;&#x3002;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x76F4;&#x767D;&#xFF0C;&#x53CD;&#x6B63;&#x53EA;&#x662F;&#x751F;&#x6210;&#x4E00;&#x904D;&#x9875;&#x9762;&#x800C;&#x5DF2;&#xFF0C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x641E;&#x4EC0;&#x4E48;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x6570;&#x636E;&#x5E93;&#x561B;&#xFF0C;&#x5C31;&#x7B97;&#x6709;&#x5FC5;&#x8981;&#x4E5F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4E0A; SQLite&#xFF08;&#x5F53;&#x7136;&#x6211;&#x6CA1;&#x6709;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x7528;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x4E86;&#xFF09;&#x3002;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x6A21;&#x677F;&#x91CC;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x603B;&#x4E4B;&#x662F;&#x628A;&#x6240;&#x6709;&#x4E0D;&#x7B26;&#x5408;&#x81EA;&#x5DF1;&#x4E60;&#x60EF;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x6539;&#x4E86;&#x4E00;&#x904D;&#x3002;&#x622A;&#x81F3;&#x76EE;&#x524D;&#x4E00;&#x5207;&#x5DE5;&#x4F5C;&#x7684;&#x90FD;&#x5F88;&#x826F;&#x597D;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x4E9B;&#x6211;&#x5F00;&#x59CB;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#x5730;&#x65B9;&#x4E5F;&#x90FD;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x6211;&#x4E5F;&#x5E76;&#x4E0D;&#x89C9;&#x5F97;&#x9700;&#x8981;&#x6709;&#x591A;&#x5C11;&#x591A;&#x5C11;&#x4EBA;&#x6765;&#x7528;&#x5B83;&#xFF0C;&#x53EA;&#x8981;&#x6EE1;&#x8DB3;&#x6211;&#x81EA;&#x5DF1;&#x7528;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x81F3;&#x4E8E;&#x522B;&#x4EBA;&#xFF0C;&#x968F;&#x610F;&#x3002;</p>
<p>&#x7136;&#x540E;&#x5927;&#x6982;&#x5C31;&#x662F;&#x6362;&#x624B;&#x673A;&#xFF0C;&#x4E00;&#x52A0; 3T &#x4F7F;&#x7528;&#x4E86;&#x4E24;&#x5E74;&#x5DF2;&#x7ECF;&#x662F;&#x4F24;&#x75D5;&#x7D2F;&#x7D2F;&#xFF0C;&#x4F46;&#x662F;&#x770B;&#x8D77;&#x6765;&#x53C8;&#x6CA1;&#x4EC0;&#x4E48;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x7684;&#x624B;&#x673A;&#xFF0C;&#x4E00;&#x52A0;&#x7684;&#x540E;&#x51E0;&#x4EE3;&#x4EA7;&#x54C1;&#x5B8C;&#x5168;&#x5C31;&#x662F;&#x201C;&#x4E0D;&#x8BB2;&#x7A76;&#x201D;&#xFF0C;MIX2S &#x770B;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#x4F46;&#x6CA1;&#x6709;&#x8033;&#x673A;&#x5B54;&#x4E5F;&#x6CA1;&#x6709;&#x9632;&#x6C34;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x559C;&#x6B22; MIUI&#xFF0C;Pixel 3 &#x7684;&#x6027;&#x4EF7;&#x6BD4;&#x5B8C;&#x5168;&#x5C31;&#x662F;&#x51B2;&#x7740;&#x201C;&#x6709;&#x79CD;&#x522B;&#x4E70;&#x201D;&#x53BB;&#x7684;&#xFF0C;&#x4F55;&#x51B5;&#x8FD9;&#x4E2A;&#x4EF7;&#x683C;&#x4E00;&#x65E6;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#x6CA1;&#x4FDD;&#x4FEE;&#x5C31;&#x8981;&#x4E86;&#x547D;&#x4E86;&#x3002;<strong>&#x53CD;&#x6B63;&#x6211;&#x90FD;&#x662F;&#x665A;&#x4E0A;&#x5145;&#x7535;&#xFF0C;&#x5145;&#x7684;&#x592A;&#x5FEB;&#x53CD;&#x800C;&#x8BA9;&#x6211;&#x4E0D;&#x653E;&#x5FC3;&#xFF0C;&#x5FEB;&#x5145;&#x5B8C;&#x5168;&#x6CA1;&#x4EC0;&#x4E48;&#x9700;&#x6C42;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x540E;&#x8003;&#x8651;&#x52A0;&#x94B1;&#x4E70; Galaxy S9&#xFF08;&#x56E0;&#x4E3A; 128G &#x7684; S9+ &#x5B9E;&#x5728;&#x662F;&#x8D85;&#x51FA;&#x9884;&#x7B97;&#x4E86;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x770B;&#x5230; S9+ &#x6709; 64G &#x7684;&#x7248;&#x672C;&#xFF08;&#x53CD;&#x6B63;&#x53EF;&#x4EE5;&#x63D2;&#x5B58;&#x50A8;&#x5361;&#xFF09;&#xFF0C;&#x540C;&#x65F6; 4G &#x5185;&#x5B58;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x5C0F;&#xFF0C;&#x54AC;&#x54AC;&#x7259;&#x5C31; S9+ &#x4E86;&#xFF0C;&#x53CD;&#x6B63;&#x6709;&#x5956;&#x5B66;&#x91D1;&#x548C;&#x4E0A;&#x4E2A;&#x6708;&#x7684;&#x7ED3;&#x4F59;&#x3002;&#x522B;&#x95EE;&#x6211; 6k+ &#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x4E70; iPhone&#xFF0C;&#x6211;&#x8003;&#x8651;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E1C;&#x897F;&#x6211;&#x62FF;&#x6765;&#x5B8C;&#x5168;&#x4E0D;&#x80FD;&#x7528;&#xFF08;<strong>&#x6CA1;&#x6587;&#x4EF6;&#x7BA1;&#x7406;</strong> &#x600E;&#x4E48;&#x6109;&#x5FEB;&#x7684;&#x7528; Samba &#x5728; Arch &#x548C;&#x624B;&#x673A;&#x4E4B;&#x95F4;&#x4EA4;&#x6362;&#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA; Shadowsocks &#x5904;&#x7406;&#x8D77;&#x6765;&#x4E5F;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A; iPhone &#x8FC1;&#x79FB;&#x6211;&#x6574;&#x4E2A;&#x751F;&#x6001;&#x548C;&#x4E60;&#x60EF;&#xFF0C;&#x987A;&#x4FBF;&#x8FD8; <strong>&#x6CA1;&#x6709;&#x8033;&#x673A;&#x5B54;</strong>&#xFF0C;&#x4EE5;&#x53CA; <strong>&#x88AB;&#x9650;&#x5236;&#x7684; NFC</strong>&#xFF0C;&#x4E5F; <strong>&#x4E0D;&#x80FD;&#x968F;&#x4FBF;&#x5916;&#x63A5; U &#x76D8;</strong>&#x2026;&#x2026;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x4E0D;&#x5982;&#x5F53;&#x5B83;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x4E0D;&#x8003;&#x8651;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765; Galaxy S9+ &#x5C31;&#x53D8;&#x6210;&#x4E86;&#x7B2C;&#x4E00;&#x6863;&#x914D;&#x7F6E;&#x7684;&#x9009;&#x9879;&#x3002;</p>
<p>&#x62FF;&#x5230; S9+ &#x4EE5;&#x540E;&#x624D;&#x53D1;&#x73B0;&#x591A;&#x51FA;&#x6765;&#x7684;&#x4EF7;&#x683C;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x767D;&#x82B1;&#x3002;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x8FD9;&#x4E2A;&#x624B;&#x673A;&#x552F;&#x4E00;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x66F2;&#x5C4F;&#x592A;&#x96BE;&#x8D34;&#x819C;&#x4EE5;&#x53CA;&#x62C5;&#x5FC3;&#x6454;&#x788E;&#xFF08;&#x6240;&#x4EE5;&#x60F3;&#x529E;&#x6CD5;&#x641E;&#x4E86;&#x788E;&#x5C4F;&#x9669;&#xFF09;&#x3002;&#x81F3;&#x4E8E;&#x5176;&#x5B83;&#x7684;&#x5B8C;&#x5168; OK&#xFF0C;&#x9632;&#x6C34;&#x662F;&#x4E00;&#x4E2A;&#x5E73;&#x65F6;&#x6211;&#x4E0D;&#x4F1A;&#x6545;&#x610F;&#x53BB;&#x7528;&#xFF08;&#x6211;&#x4E0D;&#x6D17;&#x624B;&#x673A;&#xFF01;&#xFF09;&#x4F46;&#x603B;&#x80FD;&#x8BA9;&#x4EBA;&#x5F88;&#x5B89;&#x5FC3;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53CC;&#x6444;&#x4E5F;&#x662F;&#x5230;&#x624B;&#x4E86;&#x4E4B;&#x540E;&#x53D1;&#x73B0; 2X &#x53D8;&#x7126;&#x5728;&#x62CD;&#x732B;&#x7684;&#x65F6;&#x5019;&#x5F88;&#x6709;&#x7528;&#xFF08;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x8FFD;&#x7684;&#x592A;&#x8FD1;&#x732B;&#x732B;&#x8DD1;&#x6389;&#x4E86;&#xFF09;&#xFF0C;&#x6307;&#x7EB9;&#x8BC6;&#x522B;&#x5728;&#x540E;&#x9762;&#x603B;&#x6BD4;&#x6CA1;&#x6709;&#x8981;&#x5F3A;&#xFF08;&#x6BD5;&#x7ADF;&#x6211;&#x5F88;&#x8BA8;&#x538C;&#x5B9E;&#x4F53;&#x6309;&#x538B; Home &#x952E;&#xFF09;&#xFF0C;&#x6709; NFC&#xFF0C;&#x5C4F;&#x5E55;&#x6C34;&#x5E73;&#x4E2D;&#x89C4;&#x4E2D;&#x77E9;&#xFF08;&#x624B;&#x673A;&#x5C45;&#x7136;&#x53EF;&#x4EE5;&#x5207;&#x6362;&#x5206;&#x8FA8;&#x7387;&#x4F60;&#x6562;&#x4FE1;&#xFF01;&#x5E73;&#x65F6;&#x7528; 1080P &#x5C31;&#x5F88;&#x6E05;&#x6670;&#x4E86;&#x3002;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x63D2;&#x5B58;&#x50A8;&#x5361;&#xFF0C;&#x8033;&#x673A;&#x5B54;&#x7EDD;&#x5BF9;&#x662F;&#x52A0;&#x5206;&#x9879;&#x76EE;&#xFF0C;&#x7279;&#x522B;&#x662F; <strong>&#x968F;&#x5305;&#x88C5;&#x9001;&#x4E86; AKG &#x8033;&#x673A;&#x3001;USB-C &#x5230; MicroUSB &#x7684;&#x8F6C;&#x63A5;&#x5934;&#xFF0C;USB-C &#x5230; USB-A &#x7684;&#x8F6C;&#x63A5;&#x5934;&#xFF08;&#x672C;&#x6765;&#x662F;&#x6362;&#x673A;&#x52A9;&#x624B;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x63A5; U &#x76D8;&#xFF09;&#x3001;&#x900F;&#x660E;&#x624B;&#x673A;&#x58F3;&#x751A;&#x81F3;&#x8FD8;&#x6709;&#x65E0;&#x7EBF;&#x5145;&#x7535;&#x5668;&#xFF08;&#x804A;&#x80DC;&#x4E8E;&#x65E0;&#xFF0C;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x53EA;&#x662F;&#x591A;&#x4E86;&#x4E00;&#x4E2A;&#x5145;&#x7535;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x89D2;&#x5EA6;&#x4EC0;&#x4E48;&#x7684;&#x5E76;&#x4E0D;&#x5341;&#x5206;&#x5408;&#x9002;&#xFF09;</strong>&#xFF0C;&#x751A;&#x81F3;&#x4F3C;&#x4E4E;&#x8FD8;&#x53EF;&#x4EE5;&#x4E00;&#x8FB9;&#x63A5;&#x6536; WiFi &#x4E00;&#x8FB9;&#x5F00;&#x70ED;&#x70B9;&#xFF08;&#xFF01;&#xFF01;&#xFF01;&#xFF09;&#x3002;&#x53E6;&#x5916;&#x8F6F;&#x4EF6;&#x4E0A;&#x4E5F;&#x548C;&#x5F53;&#x521D;&#x7684; TouchWiz &#x6709;&#x5929;&#x58E4;&#x4E4B;&#x522B;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x52A8;&#x753B;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x53EF;&#x914D;&#x7F6E;&#x9879;&#x591A;&#x5230;&#x6839;&#x672C;&#x7FFB;&#x4E0D;&#x5B8C;&#xFF08;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x8FD9;&#x662F;&#x4F18;&#x70B9;&#xFF09;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x559C;&#x6B22;&#x8FD4;&#x56DE;&#x952E;&#x5728;&#x5DE6;&#x4FA7;&#xFF08;OK&#xFF09;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x684C;&#x9762;&#x4E0B;&#x62C9;&#x901A;&#x77E5;&#x680F;&#xFF0C;<strong>&#x4E0D;&#x4F46;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x662F;&#x5426;&#x663E;&#x793A;&#x4E8C;&#x7EA7;&#x83DC;&#x5355;&#xFF08;&#x4E8C;&#x7EA7;&#x83DC;&#x5355;&#x7231;&#x597D;&#x8005;&#x624B;&#x52A8;&#x5410;&#x69FD;&#x4E00;&#x4F17;&#x56FD;&#x4EA7;&#x548C; iPhone&#xFF09;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x662F;&#x624B;&#x52BF;&#x5F00;&#x542F;&#x4E8C;&#x7EA7;&#x83DC;&#x5355;&#x8FD8;&#x662F;&#x5355;&#x72EC;&#x56FE;&#x6807;&#xFF08;&#x53EF;&#x60DC;&#x56FE;&#x6807;&#x4E0D;&#x80FD;&#x6362;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E0D;&#x8FC7;&#x53CD;&#x6B63;&#x6211;&#x7528;&#x624B;&#x52BF;&#xFF09;</strong>&#xFF0C;&#x684C;&#x9762;&#x53EF;&#x4EE5;&#x6A2A;&#x5C4F;&#x2026;&#x2026;&#x4EE5;&#x53CA; Android P &#x7684;&#x66F4;&#x65B0;&#x2026;&#x2026;&#x987A;&#x4FBF;&#x8FD8;&#x6709;&#x80FD;&#x89E3;&#x51B3;&#x6BD2;&#x7624;&#x4F46;&#x662F;&#x53C8;&#x4E0D;&#x8FC7;&#x5206;&#x7A81;&#x51FA;&#x7684;&#x667A;&#x80FD;&#x7BA1;&#x7406;&#x5668;&#xFF08;&#x771F;&#x7684;&#x597D;&#x7528;&#xFF0C;&#x4E0D;&#x662F;&#x5047;&#x7684;&#xFF0C;&#x5B9E;&#x540D;&#x63A8;&#x8350;&#xFF09;&#xFF0C;&#x8FDE;&#x6211;&#x8FD9;&#x79CD;&#x539F;&#x751F;&#x515A;&#x4E5F;&#x975E;&#x5E38;&#x6EE1;&#x610F;&#x3002;&#x751A;&#x81F3;&#x5728; Note 9 &#x4E0A;&#x7528;&#x4EFB;&#x610F;&#x7EBF;&#x7F06;&#x5C31;&#x80FD;&#x5F00;&#x542F; DeX &#x7684;&#x7279;&#x6027;&#x4E5F;&#x5728; Android P &#x901A;&#x8FC7;&#x8F6F;&#x4EF6;&#x66F4;&#x65B0;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#xFF08;&#x5728; S9 &#x4E0A; <strong>&#x4E0D;&#x662F;&#x786C;&#x4EF6;&#x9650;&#x5236;</strong>&#xFF01;&#x4E09;&#x661F;&#x4E5F; <strong>&#x6CA1;&#x6709;&#x5F3A;&#x884C;&#x8981;&#x6C42;&#x4F60;&#x4E70;&#x4ED6;&#x81EA;&#x5BB6;&#x5E95;&#x5EA7;</strong> &#x7684;&#x610F;&#x601D;&#xFF01;&#x4EB2;&#x6D4B;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x9609;&#x5272;&#x3002;&#xFF09;&#xFF0C;&#x624B;&#x52A8; @ &#x67D0;&#x6CA1;&#x826F;&#x5FC3;&#x914D;&#x4EF6;&#x5382;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6708;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x5B89;&#x6170;&#x7684;&#x5C31;&#x662F;&#x53C8;&#x770B;&#x4E86;&#x4E00;&#x90E8; 9.8 &#x5206;&#x7684;&#x756A;&#xFF08;&#x4E0A;&#x4E00;&#x4E2A; 9.8 &#x7684;&#x662F;&#x536B;&#x5BAB;&#x5BB6;&#x4ECA;&#x5929;&#x7684;&#x996D;&#xFF09;&#xFF0C;<em>&#x9752;&#x6625;&#x732A;&#x5934;&#x5C11;&#x5E74;&#x4E0D;&#x4F1A;&#x68A6;&#x5230;&#x5154;&#x5973;&#x90CE;&#x5B66;&#x59D0;</em>&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x9AD8;&#x60C5;&#x5546;&#x7537;&#x4E3B;&#x548C;&#x771F;&#x6B63;&#x7684;&#x9AD8;&#x60C5;&#x5546;&#x5973;&#x4E3B;&#x4EE5;&#x53CA;&#x4E0D;&#x72D7;&#x8840;&#x7684;&#x7231;&#x60C5;&#x6545;&#x4E8B;&#x8BA9;&#x4EBA;&#x5B9E;&#x540D;&#x7FA1;&#x6155;&#x554A;&#xFF0C;&#x987A;&#x4FBF;&#x6A31;&#x5C9B;&#x9EBB;&#x8863;&#x771F;&#x53EF;&#x7231;&#xFF01;&#x56DE;&#x5934;&#x518D;&#x770B;&#x770B;&#x67D0;&#x4E9B;&#x5E9F;&#x7269;&#x540E;&#x5BAB;&#x7537;&#xFF0C;&#x6574;&#x4E2A;&#x7684;&#x8D28;&#x91CF;&#x5DF2;&#x7ECF;&#x662F;&#x5728;&#x6076;&#x5FC3;&#x4EBA;&#x4E86;&#xFF0C;&#x8981;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x660E;&#x5E74;&#x7684;&#x7535;&#x78C1;&#x70AE;&#xFF0C;&#x8C01;&#x4F1A;&#x82B1;&#x94B1;&#x770B;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x554A;&#x5582;&#xFF01;&#x90FD;&#x4E0D;&#x662F;&#x5C0F;&#x5B66;&#x751F;&#x4E86;&#xFF0C;&#x5929;&#x5929;&#x6BD4;&#x8FD9;&#x4E2A;&#x5F3A;&#x6BD4;&#x90A3;&#x4E2A;&#x5F3A;&#x7B97;&#x6218;&#x6597;&#x529B;&#x6709;&#x610F;&#x601D;&#x5417;&#xFF1F;</p>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5E78;&#x798F;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x4E0D;&#x5E78;&#x7684;&#x4E8B;&#x60C5;&#x5219;&#x5404;&#x6709;&#x5404;&#x7684;&#x4E0D;&#x5E78;&#xFF0C;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;<strong>&#x5E78;&#x798F;&#x7684;&#x4E8B;&#x60C5;&#x5E76;&#x4E0D;&#x5728;&#x4E8E;&#x4E8B;&#x60C5;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x7B49;&#x5F85;&#x8FD9;&#x4EF6;&#x4E8B;&#x60C5;&#x5230;&#x6765;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;</strong>&#xFF0C;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x6162;&#x6162;&#x5347;&#x8D77;&#x7684;&#x6C14;&#x7403;&#xFF0C;&#x5F53;&#x5B83;&#x4E0A;&#x5347;&#x5230;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53CD;&#x800C;&#x4F1A;&#x6709;&#x96BE;&#x4EE5;&#x63A9;&#x76D6;&#x7684;&#x5931;&#x843D;&#x611F;&#x3002;&#x53CD;&#x6B63;&#x5929;&#x4E0B;&#x6CA1;&#x6709;&#x4E0D;&#x6563;&#x7684;&#x5BB4;&#x5E2D;&#xFF0C;&#x5E78;&#x798F;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x603B;&#x4F1A;&#x7ED3;&#x675F;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x5982;&#x6B64;&#x4EBA;&#x4EEC;&#x624D;&#x4F1A;&#x7ED9;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x53C8;&#x4E00;&#x4E2A;&#x7406;&#x7531;&#x8BA9;&#x5E73;&#x51E1;&#x7684;&#x65E5;&#x5B50;&#x53D8;&#x7684;&#x4E0D;&#x5E73;&#x51E1;&#xFF0C;&#x597D;&#x6709;&#x4E0B;&#x4E00;&#x4E2A;&#x76FC;&#x5934;&#x652F;&#x6491;&#x81EA;&#x5DF1;&#x6D3B;&#x4E0B;&#x53BB;&#x3002;&#x4F46;&#x662F;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x53C8;&#x7559;&#x4E0B;&#x4E86;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x5DF2;&#x7ECF;&#x662F;&#x6708;&#x4EAE;&#x5347;&#x8D77;&#x7684;&#x65F6;&#x5019;&#x4E86;&#xFF0C;&#x4F55;&#x7B49;&#x611A;&#x8822;&#x800C;&#x5E78;&#x798F;&#x7684;&#x4EBA;&#x554A;&#xFF01;</p>
<p><em>AlynxZhou</em></p>
<p><strong>A Coder &amp; Dreamer</strong></p>

    </main>
    <footer class="post-footer">
      
      <div class="post-tags">
        <a class="post-tag button" href="/tags/%E9%9A%8F%E8%AE%B0/" rel="tag"><i class="fas fa-tag"></i>随记</a>
      </div>
      
    </footer>
  </article>
  
  <nav class="page-nav">
    <div class="page-nav-next page-nav-item">
      
      <a href="/posts/JavaScript-YAML-Timezone-Moment/" rel="next" title="使用 Moment 处理 JavaScript 与 YAML 的时区转换"><i class="fas fa-angle-left"></i><span class="nav-title">使用 Moment 处理 JavaScript 与 YAML 的时区转换</span></a>
      
    </div>
    <div class="page-nav-prev page-nav-item">
      
      <a href="/posts/Learning-C-1/" rel="prev" title="C 语言学习 1"><span class="nav-title">C 语言学习 1</span><i class="fas fa-angle-right"></i></a>
      
    </div>
  </nav>
  
  
<div class="reward" id="reward">
  <p>既然看了喵写的文章，不打算投喂一下再走吗？哼！</p>
  <button id="reward-button" class="button" disable="enable"><i class="fas fa-donate"></i>打赏</button>
  <div id="qr" class="qr" style="display: none;" aria-hidden="true">
    
    <div id="wechat">
      <img id="wechat_qr" src="/images/WeChatPay.png" alt="微信支付"/>
      <span>微信支付</span>
    </div>
    
    
    <div id="alipay">
      <img id="alipay_qr" src="/images/AliPay.png" alt="支付宝"/>
      <span>支付宝</span>
    </div>
    
    
  </div>
</div>


  
  
  
  

<div class="comments" id="comments">
  
  <div class="commentjs" id="comment-thread"></div>
  <link rel="stylesheet" href="/css/commentjs.css">
  <script defer type="text/javascript" src="/js/marked.min.js"></script>
  <script defer type="text/javascript" src="/js/timeago.min.js"></script>
  <script defer type="text/javascript" src="/js/highlight.min.js"></script>
  <script defer type="text/javascript" src="/js/commentjs.js"></script>
  <script type="text/javascript">
  $(document).ready(function () {
    getComments({
      "type": "github",
      "user": "AlynxZhou",
      "repo": "stackharbor.alynx.xyz",
      "clientID": "",
      "clientSecret": "6db7dd16477eadc1e96160a23c6ba4cf687dcecf",
      "no_comment": "这个页面还没有评论，现在就去评论吧！",
      "go_to_comment": "去评论",
      "issue_title": "StackHarbor 的 2018 尾记",
      "btn_class": "button",
      "comments_target": "#comment-thread"
    });
    marked.setOptions({
      "highlight": function (code, lang) {
        return hljs.highlightAuto(code).value;
      }
    });
    function mark() {
      var markdowns = document.getElementsByClassName("markdown");
      for (var i = 0; i < markdowns.length; ++i){
        if (markdowns[i].innerHTML) {
          markdowns[i].innerHTML = marked(markdowns[i].innerHTML);
        }
      }
    }
    window.addEventListener("DOMContentLoaded", mark, false);
    window.addEventListener("load", mark, false);
  });
  </script>
  
</div>



  
</div>

          </div>
          
          
          
<aside class="sidebar" id="sidebar" style="background: url(/images/background.png);">
  
  <div class="search">
    <div class="form-group">
      <i class="fas fa-search"></i><input type="search" id="search-input" name="q" results="0" placeholder="搜索" class="form-control"/>
    </div>
  </div>
  <div class="search-result-box" id="search-result"></div>
  
  
<div class="info sidebar-item" id="info">
  
  <img class="author-avatar" src="/images/Future_Gazer_small.png" alt="AlynxZhou">
  
  <h1 class="author-name">AlynxZhou</h1>
  <h2 class="author-description">Everything that lives is designed to end.</h2>
  <div class="site-count">
    
    
    
    
    <div class="archives-count count-block">
      <div class="site-count-title">归档</div>
      <div><a href="/archives/">49</a></div>
    </div>
    
    
    
    <div class="categories-count count-block">
      <div class="site-count-title">分类</div>
      <div><a href="/categories/">38</a></div>
    </div>
    
    
    
    <div class="tags-count count-block">
      <div class="site-count-title">标签</div>
      <div><a href="/tags/">61</a></div>
    </div>
    
    
    
    
    
    
  </div>
  
  <div class="rss">
    <a class="rss-link button sidebar-item" href="/atom.xml"><i class="fas fa-rss"></i>RSS</a>
  </div>
  
</div>


  <div class="sidebar-sticky">
    
    
    
    
    <hr>
    <div class="social-link sidebar-item">
      <div><i class="far fa-address-card"></i>社交链接</p></div>
      <ul>
        
        <li><i class="fas fa-envelope"></i><a href="mailto:alynx.zhou@gmail.com" target="_blank">E-Mail</a></li>
        
        <li><i class="fab fa-github"></i><a href="https://github.com/AlynxZhou/" target="_blank">GitHub</a></li>
        
        <li><i class="fab fa-telegram-plane"></i><a href="https://t.me/AlynxZhou/" target="_blank">Telegram</a></li>
        
        <li><i class="fas fa-video"></i><a href="https://space.bilibili.com/10034969/" target="_blank">Bilibili</a></li>
        
        <li><i class="fab fa-weibo"></i><a href="https://weibo.com/u/5287501461" target="_blank">Weibo</a></li>
        
      </ul>
    </div>
    
    
    <hr>
    <div class="blogroll sidebar-item">
      <div><i class="fas fa-user-friends"></i>友情链接</div>
      <ul>
        
        <li><i class="fas fa-link"></i><a href="https://lrscy.github.io/" target="_blank">Meow's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://lgiki.cc/" target="_blank">LGiki's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://hackghost.com/" target="_blank">Hack Ghost's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://chenxy.moe/" target="_blank">Art_Chen's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jm33.me/" target="_blank">Jm33_m0's Blog</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://farseerfc.me/" target="_blank">Farseerfc 的小窝</a></li>
        
        <li><i class="fas fa-link"></i><a href="http://huaji.store/" target="_blank">滑稽仓库</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://jitui.moe/" target="_blank">鸡腿工坊</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sh.yorushika.live/" target="_blank">月十</a></li>
        
        <li><i class="fas fa-link"></i><a href="https://sqyon.com/" target="_blank">sqyon</a></li>
        
      </ul>
    </div>
    
  </div>
</aside>


          
        </div>
      </div>
    </main>
    
<footer id="footer" class="footer" style="background: #33363b;">
  <div class="container">
    <div class="back-to-top">
      <button id="back-to-top"><i class="fas fa-angle-double-up" aria-label="回到顶部"></i></button>
    </div>
    <div class="footer-container">
      <div class="footer-left">
        <div class="copyright">
          <span class="author"><i class="far fa-edit"></i>AlynxZhou</span><span class="years"><i class="far fa-copyright"></i><span id="years-text">2016</span></span><span class="creative-commons"><i class="fab fa-creative-commons"></i><a href="http://creativecommons.org/licenses/by-nc-nd/4.0/" target="_blank">BY-NC-ND 4.0</a></span>
        </div>
        
        <div class="busuanzi">
          <span id="busuanzi_container_site_pv"><i class="fas fa-eye" aria-label="站点点击量" aria-hidden="false"></i><span id="busuanzi_value_site_pv"></span></span><span id="busuanzi_container_site_uv"><i class="fas fa-user" aria-label="站点用户数" aria-hidden="false"></i><span id="busuanzi_value_site_uv"></span></span><span id="busuanzi_container_page_pv"><i class="fas fa-file-alt"></i><span id="busuanzi_value_page_pv" aria-label="页面点击量" aria-hidden="false"></span></span>
        </div>
        
      </div>
      <div class="footer-right">
        <div class="custom-info">
          
          托管于<i class="fab fa-github-alt"></i><a href="https://pages.github.com/" target="_blank">GitHub Pages</a>
          
        </div>
        <div class="powered-by">
          由 <a href="https://github.com/AlynxZhou/hikaru/" target="_blank">Hikaru</a> 强力驱动<i class="fab fa-node-js"></i>主题 <a href="https://github.com/AlynxZhou/hikaru-theme-aria/" target="_blank">ARIA</a>
        </div>
      </div>
    </div>
  </div>
</footer>


  </body>
</html>
<!-- Page built by Hikaru v1.13.1 at 2019-01-22 周二 16:42:33 CST. -->
